zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K344-257BGA-pinctrl.h
/* TRGMUX */
#define PTA0_TRGMUX_OUT3                NXP_S32_PINMUX(0, 0, 7, 0, 0)
#define PTA1_TRGMUX_OUT0                NXP_S32_PINMUX(0, 1, 7, 0, 0)
#define PTA18_TRGMUX_IN12               NXP_S32_PINMUX(0, 18, 0, 356, 1)
#define PTA19_TRGMUX_IN13               NXP_S32_PINMUX(0, 19, 0, 357, 1)
#define PTA20_TRGMUX_IN14               NXP_S32_PINMUX(0, 20, 0, 358, 1)
#define PTA21_TRGMUX_IN15               NXP_S32_PINMUX(0, 21, 0, 359, 1)
#define PTA31_TRGMUX_OUT8               NXP_S32_PINMUX(0, 31, 7, 0, 0)
#define PTB2_TRGMUX_IN3                 NXP_S32_PINMUX(0, 34, 0, 347, 1)
#define PTB3_TRGMUX_IN2                 NXP_S32_PINMUX(0, 35, 0, 346, 1)
#define PTB4_TRGMUX_IN1                 NXP_S32_PINMUX(0, 36, 0, 345, 1)
#define PTB5_TRGMUX_IN0                 NXP_S32_PINMUX(0, 37, 0, 344, 1)
#define PTB18_TRGMUX_OUT9               NXP_S32_PINMUX(0, 50, 7, 0, 0)
#define PTB19_TRGMUX_OUT10              NXP_S32_PINMUX(0, 51, 7, 0, 0)
#define PTB20_TRGMUX_OUT11              NXP_S32_PINMUX(0, 52, 7, 0, 0)
#define PTB21_TRGMUX_OUT12              NXP_S32_PINMUX(0, 53, 7, 0, 0)
#define PTB22_TRGMUX_OUT13              NXP_S32_PINMUX(0, 54, 7, 0, 0)
#define PTB23_TRGMUX_OUT14              NXP_S32_PINMUX(0, 55, 7, 0, 0)
#define PTC10_TRGMUX_IN11               NXP_S32_PINMUX(0, 74, 0, 355, 1)
#define PTC11_TRGMUX_IN10               NXP_S32_PINMUX(0, 75, 0, 354, 1)
#define PTC14_TRGMUX_IN9                NXP_S32_PINMUX(0, 78, 0, 353, 1)
#define PTC15_TRGMUX_IN8                NXP_S32_PINMUX(0, 79, 0, 352, 1)
#define PTC24_TRGMUX_OUT15              NXP_S32_PINMUX(0, 88, 7, 0, 0)
#define PTD0_TRGMUX_OUT1                NXP_S32_PINMUX(0, 96, 7, 0, 0)
#define PTD1_TRGMUX_OUT2                NXP_S32_PINMUX(0, 97, 7, 0, 0)
#define PTD2_TRGMUX_IN5                 NXP_S32_PINMUX(0, 98, 0, 349, 1)
#define PTD3_TRGMUX_IN4                 NXP_S32_PINMUX(0, 99, 0, 348, 1)
#define PTD5_TRGMUX_IN7                 NXP_S32_PINMUX(0, 101, 0, 351, 1)
#define PTE3_TRGMUX_IN6                 NXP_S32_PINMUX(0, 131, 0, 350, 1)
#define PTE10_TRGMUX_OUT4               NXP_S32_PINMUX(0, 138, 7, 0, 0)
#define PTE11_TRGMUX_OUT5               NXP_S32_PINMUX(0, 139, 7, 0, 0)
#define PTE15_TRGMUX_OUT6               NXP_S32_PINMUX(0, 143, 7, 0, 0)
#define PTE16_TRGMUX_OUT7               NXP_S32_PINMUX(0, 144, 7, 0, 0)

/* LPUART0 */
#define PTA0_LPUART0_CTS                NXP_S32_PINMUX(0, 0, 0, 360, 1)
#define PTA1_LPUART0_RTS                NXP_S32_PINMUX(0, 1, 3, 0, 0)
#define PTA2_LPUART0_RX                 NXP_S32_PINMUX(0, 2, 0, 187, 1)
#define PTA3_LPUART0_TX_O               NXP_S32_PINMUX(0, 3, 6, 0, 0)
#define PTA3_LPUART0_TX_I               NXP_S32_PINMUX(0, 3, 0, 363, 1)
#define PTA27_LPUART0_TX_O              NXP_S32_PINMUX(0, 27, 4, 0, 0)
#define PTA27_LPUART0_TX_I              NXP_S32_PINMUX(0, 27, 0, 363, 4)
#define PTA28_LPUART0_RX                NXP_S32_PINMUX(0, 28, 0, 187, 4)
#define PTB0_LPUART0_RX                 NXP_S32_PINMUX(0, 32, 0, 187, 2)
#define PTB1_LPUART0_TX_O               NXP_S32_PINMUX(0, 33, 2, 0, 0)
#define PTB1_LPUART0_TX_I               NXP_S32_PINMUX(0, 33, 0, 363, 2)
#define PTC2_LPUART0_RX                 NXP_S32_PINMUX(0, 66, 0, 187, 3)
#define PTC3_LPUART0_TX_O               NXP_S32_PINMUX(0, 67, 4, 0, 0)
#define PTC3_LPUART0_TX_I               NXP_S32_PINMUX(0, 67, 0, 363, 3)
#define PTC8_LPUART0_CTS                NXP_S32_PINMUX(0, 72, 0, 360, 2)
#define PTC9_LPUART0_RTS                NXP_S32_PINMUX(0, 73, 3, 0, 0)

/* FCCU */
#define PTA2_FCCU_ERR0                  NXP_S32_PINMUX(0, 2, 1, 0, 0)
#define PTA2_FCCU_ERR_IN0               NXP_S32_PINMUX(0, 2, 0, 148, 1)
#define PTA3_FCCU_ERR1                  NXP_S32_PINMUX(0, 3, 1, 0, 0)
#define PTA3_FCCU_ERR_IN1               NXP_S32_PINMUX(0, 3, 0, 149, 1)
#define PTE15_FCCU_ERR0                 NXP_S32_PINMUX(0, 143, 1, 0, 0)
#define PTE15_FCCU_ERR_IN0              NXP_S32_PINMUX(0, 143, 0, 148, 2)
#define PTE16_FCCU_ERR1                 NXP_S32_PINMUX(0, 144, 1, 0, 0)
#define PTE16_FCCU_ERR_IN1              NXP_S32_PINMUX(0, 144, 0, 149, 2)
#define PTF14_FCCU_ERR0                 NXP_S32_PINMUX(0, 174, 4, 0, 0)
#define PTF14_FCCU_ERR_IN0              NXP_S32_PINMUX(0, 174, 0, 148, 3)
#define PTF15_FCCU_ERR1                 NXP_S32_PINMUX(0, 175, 5, 0, 0)
#define PTF15_FCCU_ERR_IN1              NXP_S32_PINMUX(0, 175, 0, 149, 3)

/* LPSPI5 */
#define PTA2_LPSPI5_SIN_O               NXP_S32_PINMUX(0, 2, 7, 0, 0)
#define PTA2_LPSPI5_SIN_I               NXP_S32_PINMUX(0, 2, 0, 267, 2)
#define PTA3_LPSPI5_SCK_O               NXP_S32_PINMUX(0, 3, 7, 0, 0)
#define PTA3_LPSPI5_SCK_I               NXP_S32_PINMUX(0, 3, 0, 266, 2)
#define PTA14_LPSPI5_PCS1_O             NXP_S32_PINMUX(0, 14, 7, 0, 0)
#define PTA14_LPSPI5_PCS1_I             NXP_S32_PINMUX(0, 14, 0, 263, 2)
#define PTA15_LPSPI5_PCS0_O             NXP_S32_PINMUX(0, 15, 6, 0, 0)
#define PTA15_LPSPI5_PCS0_I             NXP_S32_PINMUX(0, 15, 0, 262, 3)
#define PTD2_LPSPI5_SOUT_O              NXP_S32_PINMUX(0, 98, 7, 0, 0)
#define PTD2_LPSPI5_SOUT_I              NXP_S32_PINMUX(0, 98, 0, 268, 2)
#define PTD4_LPSPI5_PCS0_O              NXP_S32_PINMUX(0, 100, 7, 0, 0)
#define PTD4_LPSPI5_PCS0_I              NXP_S32_PINMUX(0, 100, 0, 262, 2)
#define PTD13_LPSPI5_SIN_O              NXP_S32_PINMUX(0, 109, 1, 0, 0)
#define PTD13_LPSPI5_SIN_I              NXP_S32_PINMUX(0, 109, 0, 267, 1)
#define PTD14_LPSPI5_SCK_O              NXP_S32_PINMUX(0, 110, 1, 0, 0)
#define PTD14_LPSPI5_SCK_I              NXP_S32_PINMUX(0, 110, 0, 266, 1)
#define PTD17_LPSPI5_PCS0_O             NXP_S32_PINMUX(0, 113, 1, 0, 0)
#define PTD17_LPSPI5_PCS0_I             NXP_S32_PINMUX(0, 113, 0, 262, 1)
#define PTD26_LPSPI5_SCK_O              NXP_S32_PINMUX(0, 122, 6, 0, 0)
#define PTD26_LPSPI5_SCK_I              NXP_S32_PINMUX(0, 122, 0, 266, 3)
#define PTD27_LPSPI5_SOUT_O             NXP_S32_PINMUX(0, 123, 6, 0, 0)
#define PTD27_LPSPI5_SOUT_I             NXP_S32_PINMUX(0, 123, 0, 268, 3)
#define PTD28_LPSPI5_SIN_O              NXP_S32_PINMUX(0, 124, 6, 0, 0)
#define PTD28_LPSPI5_SIN_I              NXP_S32_PINMUX(0, 124, 0, 267, 3)
#define PTD29_LPSPI5_PCS2_O             NXP_S32_PINMUX(0, 125, 6, 0, 0)
#define PTD29_LPSPI5_PCS2_I             NXP_S32_PINMUX(0, 125, 0, 264, 1)
#define PTD30_LPSPI5_PCS3_O             NXP_S32_PINMUX(0, 126, 6, 0, 0)
#define PTD30_LPSPI5_PCS3_I             NXP_S32_PINMUX(0, 126, 0, 265, 1)
#define PTE8_LPSPI5_PCS1_O              NXP_S32_PINMUX(0, 136, 3, 0, 0)
#define PTE8_LPSPI5_PCS1_I              NXP_S32_PINMUX(0, 136, 0, 263, 1)
#define PTE9_LPSPI5_SOUT_O              NXP_S32_PINMUX(0, 137, 1, 0, 0)
#define PTE9_LPSPI5_SOUT_I              NXP_S32_PINMUX(0, 137, 0, 268, 1)

