zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K344-257BGA-pinctrl.h
/* LPSPI1 */
#define PTA2_LPSPI1_SIN                 NXP_S32_PINMUX(0, 2, 0, 239, 2)
#define PTA3_LPSPI1_SCK_O               NXP_S32_PINMUX(0, 3, 3, 0, 0)
#define PTA3_LPSPI1_SCK_I               NXP_S32_PINMUX(0, 3, 0, 238, 1)
#define PTA6_LPSPI1_PCS1_O              NXP_S32_PINMUX(0, 6, 3, 0, 0)
#define PTA6_LPSPI1_PCS1_I              NXP_S32_PINMUX(0, 6, 0, 233, 1)
#define PTA11_LPSPI1_PCS0_O             NXP_S32_PINMUX(0, 11, 6, 0, 0)
#define PTA11_LPSPI1_PCS0_I             NXP_S32_PINMUX(0, 11, 0, 232, 2)
#define PTA12_LPSPI1_PCS5_O             NXP_S32_PINMUX(0, 12, 1, 0, 0)
#define PTA12_LPSPI1_PCS5_I             NXP_S32_PINMUX(0, 12, 0, 237, 1)
#define PTA13_LPSPI1_PCS4_O             NXP_S32_PINMUX(0, 13, 1, 0, 0)
#define PTA13_LPSPI1_PCS4_I             NXP_S32_PINMUX(0, 13, 0, 236, 1)
#define PTA14_LPSPI1_PCS3_O             NXP_S32_PINMUX(0, 14, 3, 0, 0)
#define PTA14_LPSPI1_PCS3_I             NXP_S32_PINMUX(0, 14, 0, 235, 2)
#define PTA16_LPSPI1_PCS2_O             NXP_S32_PINMUX(0, 16, 3, 0, 0)
#define PTA16_LPSPI1_PCS2_I             NXP_S32_PINMUX(0, 16, 0, 234, 2)
#define PTA18_LPSPI1_SOUT_O             NXP_S32_PINMUX(0, 18, 4, 0, 0)
#define PTA18_LPSPI1_SOUT_I             NXP_S32_PINMUX(0, 18, 0, 240, 4)
#define PTA19_LPSPI1_SCK_O              NXP_S32_PINMUX(0, 19, 4, 0, 0)
#define PTA19_LPSPI1_SCK_I              NXP_S32_PINMUX(0, 19, 0, 238, 3)
#define PTA20_LPSPI1_SIN_O              NXP_S32_PINMUX(0, 20, 4, 0, 0)
#define PTA20_LPSPI1_SIN_I              NXP_S32_PINMUX(0, 20, 0, 239, 3)
#define PTA21_LPSPI1_PCS0_O             NXP_S32_PINMUX(0, 21, 4, 0, 0)
#define PTA21_LPSPI1_PCS0_I             NXP_S32_PINMUX(0, 21, 0, 232, 3)
#define PTA22_LPSPI1_PCS1_O             NXP_S32_PINMUX(0, 22, 4, 0, 0)
#define PTA22_LPSPI1_PCS1_I             NXP_S32_PINMUX(0, 22, 0, 233, 3)
#define PTA26_LPSPI1_PCS0_O             NXP_S32_PINMUX(0, 26, 3, 0, 0)
#define PTA26_LPSPI1_PCS0_I             NXP_S32_PINMUX(0, 26, 0, 232, 5)
#define PTA28_LPSPI1_SCK_O              NXP_S32_PINMUX(0, 28, 3, 0, 0)
#define PTA28_LPSPI1_SCK_I              NXP_S32_PINMUX(0, 28, 0, 238, 4)
#define PTA29_LPSPI1_SIN_O              NXP_S32_PINMUX(0, 29, 5, 0, 0)
#define PTA29_LPSPI1_SIN_I              NXP_S32_PINMUX(0, 29, 0, 239, 4)
#define PTA30_LPSPI1_SOUT_O             NXP_S32_PINMUX(0, 30, 3, 0, 0)
#define PTA30_LPSPI1_SOUT_I             NXP_S32_PINMUX(0, 30, 0, 240, 5)
#define PTB14_LPSPI1_SCK_O              NXP_S32_PINMUX(0, 46, 3, 0, 0)
#define PTB14_LPSPI1_SCK_I              NXP_S32_PINMUX(0, 46, 0, 238, 2)
#define PTB15_LPSPI1_SIN_O              NXP_S32_PINMUX(0, 47, 3, 0, 0)
#define PTB15_LPSPI1_SIN_I              NXP_S32_PINMUX(0, 47, 0, 239, 1)
#define PTB16_LPSPI1_SOUT_O             NXP_S32_PINMUX(0, 48, 3, 0, 0)
#define PTB16_LPSPI1_SOUT_I             NXP_S32_PINMUX(0, 48, 0, 240, 2)
#define PTB17_LPSPI1_PCS3_O             NXP_S32_PINMUX(0, 49, 3, 0, 0)
#define PTB17_LPSPI1_PCS3_I             NXP_S32_PINMUX(0, 49, 0, 235, 1)
#define PTB18_LPSPI1_PCS1_O             NXP_S32_PINMUX(0, 50, 4, 0, 0)
#define PTB18_LPSPI1_PCS1_I             NXP_S32_PINMUX(0, 50, 0, 233, 2)
#define PTC6_LPSPI1_PCS1_O              NXP_S32_PINMUX(0, 70, 3, 0, 0)
#define PTC6_LPSPI1_PCS1_I              NXP_S32_PINMUX(0, 70, 0, 233, 4)
#define PTD2_LPSPI1_SOUT_O              NXP_S32_PINMUX(0, 98, 3, 0, 0)
#define PTD2_LPSPI1_SOUT_I              NXP_S32_PINMUX(0, 98, 0, 240, 1)
#define PTD3_LPSPI1_PCS0_O              NXP_S32_PINMUX(0, 99, 3, 0, 0)
#define PTD3_LPSPI1_PCS0_I              NXP_S32_PINMUX(0, 99, 0, 232, 1)
#define PTD4_LPSPI1_PCS1_O              NXP_S32_PINMUX(0, 100, 3, 0, 0)
#define PTD4_LPSPI1_PCS1_I              NXP_S32_PINMUX(0, 100, 0, 233, 6)
#define PTD20_LPSPI1_PCS2_O             NXP_S32_PINMUX(0, 116, 5, 0, 0)
#define PTD20_LPSPI1_PCS2_I             NXP_S32_PINMUX(0, 116, 0, 234, 1)
#define PTE4_LPSPI1_PCS1_O              NXP_S32_PINMUX(0, 132, 2, 0, 0)
#define PTE4_LPSPI1_PCS1_I              NXP_S32_PINMUX(0, 132, 0, 233, 5)
#define PTF21_LPSPI1_PCS0_O             NXP_S32_PINMUX(0, 181, 5, 0, 0)
#define PTF21_LPSPI1_PCS0_I             NXP_S32_PINMUX(0, 181, 0, 232, 4)

/* CMP0 */
#define PTA4_CMP0_OUT                   NXP_S32_PINMUX(0, 4, 4, 0, 0)
#define PTA11_CMP0_RRT                  NXP_S32_PINMUX(0, 11, 5, 0, 0)
#define PTD14_CMP0_RRT                  NXP_S32_PINMUX(0, 110, 6, 0, 0)
#define PTE3_CMP0_OUT                   NXP_S32_PINMUX(0, 131, 7, 0, 0)
#define PTF14_CMP0_OUT                  NXP_S32_PINMUX(0, 174, 3, 0, 0)
#define PTF15_CMP0_RRT                  NXP_S32_PINMUX(0, 175, 3, 0, 0)

/* JTAG */
#define PTA4_JTAG_TMSSWD_DIO_O          NXP_S32_PINMUX(0, 4, 7, 0, 0)
#define PTA4_JTAG_TMSSWD_DIO_I          NXP_S32_PINMUX(0, 4, 0, 186, 0)
#define PTC4_JTAG_TCKSWD_CLK            NXP_S32_PINMUX(0, 68, 0, 184, 0)
#define PTC5_JTAG_TDI                   NXP_S32_PINMUX(0, 69, 0, 185, 0)

/* SYSTEM */
#define PTA12_CLKOUT_STANDBY            NXP_S32_PINMUX(0, 12, 3, 0, 0)
#define PTB5_CLKOUT_RUN                 NXP_S32_PINMUX(0, 37, 5, 0, 0)
#define PTD10_CLKOUT_RUN                NXP_S32_PINMUX(0, 106, 6, 0, 0)
#define PTD14_CLKOUT_RUN                NXP_S32_PINMUX(0, 110, 7, 0, 0)
#define PTE10_CLKOUT_STANDBY            NXP_S32_PINMUX(0, 138, 5, 0, 0)

/* LPSPI3 */
#define PTA6_LPSPI3_PCS1_O              NXP_S32_PINMUX(0, 6, 6, 0, 0)
#define PTA6_LPSPI3_PCS1_I              NXP_S32_PINMUX(0, 6, 0, 249, 5)
#define PTA9_LPSPI3_PCS0_O              NXP_S32_PINMUX(0, 9, 6, 0, 0)
#define PTA9_LPSPI3_PCS0_I              NXP_S32_PINMUX(0, 9, 0, 248, 3)
#define PTA17_LPSPI3_SOUT_O             NXP_S32_PINMUX(0, 17, 6, 0, 0)
#define PTA17_LPSPI3_SOUT_I             NXP_S32_PINMUX(0, 17, 0, 254, 2)
#define PTB12_LPSPI3_PCS3_O             NXP_S32_PINMUX(0, 44, 1, 0, 0)
#define PTB12_LPSPI3_PCS3_I             NXP_S32_PINMUX(0, 44, 0, 251, 1)
#define PTB13_LPSPI3_PCS2_O             NXP_S32_PINMUX(0, 45, 1, 0, 0)
#define PTB13_LPSPI3_PCS2_I             NXP_S32_PINMUX(0, 45, 0, 250, 1)
#define PTB17_LPSPI3_PCS0_O             NXP_S32_PINMUX(0, 49, 6, 0, 0)
#define PTB17_LPSPI3_PCS0_I             NXP_S32_PINMUX(0, 49, 0, 248, 2)
#define PTB22_LPSPI3_PCS1_O             NXP_S32_PINMUX(0, 54, 3, 0, 0)
#define PTB22_LPSPI3_PCS1_I             NXP_S32_PINMUX(0, 54, 0, 249, 4)
#define PTC2_LPSPI3_PCS2_O              NXP_S32_PINMUX(0, 66, 3, 0, 0)
#define PTC2_LPSPI3_PCS2_I              NXP_S32_PINMUX(0, 66, 0, 250, 4)
#define PTC16_LPSPI3_SIN_O              NXP_S32_PINMUX(0, 80, 1, 0, 0)
#define PTC16_LPSPI3_SIN_I              NXP_S32_PINMUX(0, 80, 0, 253, 3)
#define PTC17_LPSPI3_SCK_O              NXP_S32_PINMUX(0, 81, 1, 0, 0)
#define PTC17_LPSPI3_SCK_I              NXP_S32_PINMUX(0, 81, 0, 252, 3)
#define PTD0_LPSPI3_SOUT_O              NXP_S32_PINMUX(0, 96, 3, 0, 0)
#define PTD0_LPSPI3_SOUT_I              NXP_S32_PINMUX(0, 96, 0, 254, 1)
#define PTD1_LPSPI3_SCK_O               NXP_S32_PINMUX(0, 97, 3, 0, 0)
#define PTD1_LPSPI3_SCK_I               NXP_S32_PINMUX(0, 97, 0, 252, 1)
#define PTD7_LPSPI3_PCS3_O              NXP_S32_PINMUX(0, 103, 3, 0, 0)
#define PTD7_LPSPI3_PCS3_I              NXP_S32_PINMUX(0, 103, 0, 251, 5)
#define PTD8_LPSPI3_SOUT_O              NXP_S32_PINMUX(0, 104, 1, 0, 0)
#define PTD8_LPSPI3_SOUT_I              NXP_S32_PINMUX(0, 104, 0, 254, 3)
#define PTD17_LPSPI3_PCS0_O             NXP_S32_PINMUX(0, 113, 5, 0, 0)
#define PTD17_LPSPI3_PCS0_I             NXP_S32_PINMUX(0, 113, 0, 248, 1)
#define PTD20_LPSPI3_SIN_O              NXP_S32_PINMUX(0, 116, 6, 0, 0)
#define PTD20_LPSPI3_SIN_I              NXP_S32_PINMUX(0, 116, 0, 253, 2)
#define PTE7_LPSPI3_SCK_O               NXP_S32_PINMUX(0, 135, 6, 0, 0)
#define PTE7_LPSPI3_SCK_I               NXP_S32_PINMUX(0, 135, 0, 252, 2)
#define PTE8_LPSPI3_PCS1_O              NXP_S32_PINMUX(0, 136, 1, 0, 0)
#define PTE8_LPSPI3_PCS1_I              NXP_S32_PINMUX(0, 136, 0, 249, 1)
#define PTE10_LPSPI3_SIN_O              NXP_S32_PINMUX(0, 138, 2, 0, 0)
#define PTE10_LPSPI3_SIN_I              NXP_S32_PINMUX(0, 138, 0, 253, 1)
#define PTF12_LPSPI3_SIN_O              NXP_S32_PINMUX(0, 172, 4, 0, 0)
#define PTF12_LPSPI3_SIN_I              NXP_S32_PINMUX(0, 172, 0, 253, 4)
#define PTF13_LPSPI3_SCK_O              NXP_S32_PINMUX(0, 173, 4, 0, 0)
#define PTF13_LPSPI3_SCK_I              NXP_S32_PINMUX(0, 173, 0, 252, 4)
#define PTF15_LPSPI3_SOUT_O             NXP_S32_PINMUX(0, 175, 4, 0, 0)
#define PTF15_LPSPI3_SOUT_I             NXP_S32_PINMUX(0, 175, 0, 254, 4)
#define PTF16_LPSPI3_PCS0_O             NXP_S32_PINMUX(0, 176, 5, 0, 0)
#define PTF16_LPSPI3_PCS0_I             NXP_S32_PINMUX(0, 176, 0, 248, 4)
#define PTF18_LPSPI3_PCS1_O             NXP_S32_PINMUX(0, 178, 5, 0, 0)
#define PTF18_LPSPI3_PCS1_I             NXP_S32_PINMUX(0, 178, 0, 249, 2)
#define PTF19_LPSPI3_PCS2_O             NXP_S32_PINMUX(0, 179, 5, 0, 0)
#define PTF19_LPSPI3_PCS2_I             NXP_S32_PINMUX(0, 179, 0, 250, 2)
#define PTF20_LPSPI3_PCS3_O             NXP_S32_PINMUX(0, 180, 5, 0, 0)
#define PTF20_LPSPI3_PCS3_I             NXP_S32_PINMUX(0, 180, 0, 251, 2)
#define PTF23_LPSPI3_PCS3_O             NXP_S32_PINMUX(0, 183, 5, 0, 0)
#define PTF23_LPSPI3_PCS3_I             NXP_S32_PINMUX(0, 183, 0, 251, 3)
#define PTF29_LPSPI3_PCS1_O             NXP_S32_PINMUX(0, 189, 5, 0, 0)
#define PTF29_LPSPI3_PCS1_I             NXP_S32_PINMUX(0, 189, 0, 249, 3)

/* CAN0 */
#define PTA6_CAN0_RX                    NXP_S32_PINMUX(0, 6, 0, 0, 2)
#define PTA7_CAN0_TX                    NXP_S32_PINMUX(0, 7, 4, 0, 0)
#define PTA27_CAN0_TX                   NXP_S32_PINMUX(0, 27, 5, 0, 0)
#define PTA28_CAN0_RX                   NXP_S32_PINMUX(0, 28, 0, 0, 4)
#define PTB0_CAN0_RX                    NXP_S32_PINMUX(0, 32, 0, 0, 3)
#define PTB1_CAN0_TX                    NXP_S32_PINMUX(0, 33, 5, 0, 0)
#define PTC2_CAN0_RX                    NXP_S32_PINMUX(0, 66, 0, 0, 1)
#define PTC3_CAN0_TX                    NXP_S32_PINMUX(0, 67, 3, 0, 0)
#define PTF20_CAN0_TX                   NXP_S32_PINMUX(0, 180, 6, 0, 0)
#define PTF21_CAN0_RX                   NXP_S32_PINMUX(0, 181, 0, 0, 5)

/* LPUART3 */
#define PTA6_LPUART3_RX                 NXP_S32_PINMUX(0, 6, 0, 190, 2)
#define PTA7_LPUART3_TX_O               NXP_S32_PINMUX(0, 7, 1, 0, 0)
#define PTA7_LPUART3_TX_I               NXP_S32_PINMUX(0, 7, 0, 366, 1)
#define PTD2_LPUART3_TX_O               NXP_S32_PINMUX(0, 98, 6, 0, 0)
#define PTD2_LPUART3_TX_I               NXP_S32_PINMUX(0, 98, 0, 366, 2)
#define PTD3_LPUART3_RX                 NXP_S32_PINMUX(0, 99, 0, 190, 3)
#define PTE15_LPUART3_RX                NXP_S32_PINMUX(0, 143, 0, 190, 1)
#define PTE16_LPUART3_TX_O              NXP_S32_PINMUX(0, 144, 2, 0, 0)
#define PTE16_LPUART3_TX_I              NXP_S32_PINMUX(0, 144, 0, 366, 3)

/* LPUART1 */
#define PTA6_LPUART1_CTS                NXP_S32_PINMUX(0, 6, 0, 361, 2)
#define PTA7_LPUART1_RTS                NXP_S32_PINMUX(0, 7, 5, 0, 0)
#define PTA18_LPUART1_TX_O              NXP_S32_PINMUX(0, 18, 3, 0, 0)
#define PTA18_LPUART1_TX_I              NXP_S32_PINMUX(0, 18, 0, 364, 4)
#define PTA19_LPUART1_RX                NXP_S32_PINMUX(0, 19, 0, 188, 5)
#define PTB22_LPUART1_TX_O              NXP_S32_PINMUX(0, 54, 5, 0, 0)
#define PTB22_LPUART1_TX_I              NXP_S32_PINMUX(0, 54, 0, 364, 5)
#define PTB23_LPUART1_RX                NXP_S32_PINMUX(0, 55, 0, 188, 4)
#define PTC6_LPUART1_RX                 NXP_S32_PINMUX(0, 70, 0, 188, 1)
#define PTC7_LPUART1_TX_O               NXP_S32_PINMUX(0, 71, 2, 0, 0)
#define PTC7_LPUART1_TX_I               NXP_S32_PINMUX(0, 71, 0, 364, 1)
#define PTC8_LPUART1_RX                 NXP_S32_PINMUX(0, 72, 0, 188, 2)
#define PTC9_LPUART1_TX_O               NXP_S32_PINMUX(0, 73, 2, 0, 0)
#define PTC9_LPUART1_TX_I               NXP_S32_PINMUX(0, 73, 0, 364, 2)
#define PTD13_LPUART1_RX                NXP_S32_PINMUX(0, 109, 0, 188, 3)
#define PTD14_LPUART1_TX_O              NXP_S32_PINMUX(0, 110, 3, 0, 0)
#define PTD14_LPUART1_TX_I              NXP_S32_PINMUX(0, 110, 0, 364, 3)
#define PTE2_LPUART1_CTS                NXP_S32_PINMUX(0, 130, 0, 361, 1)
#define PTE6_LPUART1_RTS                NXP_S32_PINMUX(0, 134, 3, 0, 0)
#define PTE15_LPUART1_CTS               NXP_S32_PINMUX(0, 143, 0, 361, 3)
#define PTE16_LPUART1_RTS               NXP_S32_PINMUX(0, 144, 5, 0, 0)

/* LPSPI2 */
#define PTA8_LPSPI2_SOUT_O              NXP_S32_PINMUX(0, 8, 3, 0, 0)
#define PTA8_LPSPI2_SOUT_I              NXP_S32_PINMUX(0, 8, 0, 247, 1)
#define PTA9_LPSPI2_PCS0_O              NXP_S32_PINMUX(0, 9, 3, 0, 0)
#define PTA9_LPSPI2_PCS0_I              NXP_S32_PINMUX(0, 9, 0, 241, 1)
#define PTA15_LPSPI2_PCS3_O             NXP_S32_PINMUX(0, 15, 4, 0, 0)
#define PTA15_LPSPI2_PCS3_I             NXP_S32_PINMUX(0, 15, 0, 244, 1)
#define PTA21_LPSPI2_PCS2_O             NXP_S32_PINMUX(0, 21, 1, 0, 0)
#define PTA21_LPSPI2_PCS2_I             NXP_S32_PINMUX(0, 21, 0, 243, 1)
#define PTB2_LPSPI2_SIN_O               NXP_S32_PINMUX(0, 34, 3, 0, 0)
#define PTB2_LPSPI2_SIN_I               NXP_S32_PINMUX(0, 34, 0, 246, 2)
#define PTB3_LPSPI2_SOUT_O              NXP_S32_PINMUX(0, 35, 3, 0, 0)
#define PTB3_LPSPI2_SOUT_I              NXP_S32_PINMUX(0, 35, 0, 247, 2)
#define PTB25_LPSPI2_PCS0_O             NXP_S32_PINMUX(0, 57, 5, 0, 0)
#define PTB25_LPSPI2_PCS0_I             NXP_S32_PINMUX(0, 57, 0, 241, 4)
#define PTB27_LPSPI2_SOUT_O             NXP_S32_PINMUX(0, 59, 5, 0, 0)
#define PTB27_LPSPI2_SOUT_I             NXP_S32_PINMUX(0, 59, 0, 247, 3)
#define PTB28_LPSPI2_SIN_O              NXP_S32_PINMUX(0, 60, 5, 0, 0)
#define PTB28_LPSPI2_SIN_I              NXP_S32_PINMUX(0, 60, 0, 246, 3)
#define PTB29_LPSPI2_SCK_O              NXP_S32_PINMUX(0, 61, 5, 0, 0)
#define PTB29_LPSPI2_SCK_I              NXP_S32_PINMUX(0, 61, 0, 245, 3)
#define PTC10_LPSPI2_PCS1_O             NXP_S32_PINMUX(0, 74, 4, 0, 0)
#define PTC10_LPSPI2_PCS1_I             NXP_S32_PINMUX(0, 74, 0, 242, 3)
#define PTC12_LPSPI2_PCS1_O             NXP_S32_PINMUX(0, 76, 4, 0, 0)
#define PTC12_LPSPI2_PCS1_I             NXP_S32_PINMUX(0, 76, 0, 242, 4)
#define PTC14_LPSPI2_PCS0_O             NXP_S32_PINMUX(0, 78, 3, 0, 0)
#define PTC14_LPSPI2_PCS0_I             NXP_S32_PINMUX(0, 78, 0, 241, 2)
#define PTC15_LPSPI2_SCK_O              NXP_S32_PINMUX(0, 79, 3, 0, 0)
#define PTC15_LPSPI2_SCK_I              NXP_S32_PINMUX(0, 79, 0, 245, 2)
#define PTC19_LPSPI2_PCS1_O             NXP_S32_PINMUX(0, 83, 5, 0, 0)
#define PTC19_LPSPI2_PCS1_I             NXP_S32_PINMUX(0, 83, 0, 242, 2)
#define PTE10_LPSPI2_PCS1_O             NXP_S32_PINMUX(0, 138, 3, 0, 0)
#define PTE10_LPSPI2_PCS1_I             NXP_S32_PINMUX(0, 138, 0, 242, 1)
#define PTE11_LPSPI2_PCS0_O             NXP_S32_PINMUX(0, 139, 2, 0, 0)
#define PTE11_LPSPI2_PCS0_I             NXP_S32_PINMUX(0, 139, 0, 241, 3)
#define PTE13_LPSPI2_PCS2_O             NXP_S32_PINMUX(0, 141, 3, 0, 0)
#define PTE13_LPSPI2_PCS0_O             NXP_S32_PINMUX(0, 141, 5, 0, 0)
#define PTE13_LPSPI2_PCS0_I             NXP_S32_PINMUX(0, 141, 0, 241, 5)
#define PTE13_LPSPI2_PCS2_I             NXP_S32_PINMUX(0, 141, 0, 243, 2)
#define PTE15_LPSPI2_SCK_O              NXP_S32_PINMUX(0, 143, 3, 0, 0)
#define PTE15_LPSPI2_SCK_I              NXP_S32_PINMUX(0, 143, 0, 245, 1)
#define PTE16_LPSPI2_SIN_O              NXP_S32_PINMUX(0, 144, 3, 0, 0)
#define PTE16_LPSPI2_SIN_I              NXP_S32_PINMUX(0, 144, 0, 246, 1)
#define PTF0_LPSPI2_SCK_O               NXP_S32_PINMUX(0, 160, 3, 0, 0)
#define PTF0_LPSPI2_SCK_I               NXP_S32_PINMUX(0, 160, 0, 245, 4)
#define PTF1_LPSPI2_SIN_O               NXP_S32_PINMUX(0, 161, 3, 0, 0)
#define PTF1_LPSPI2_SIN_I               NXP_S32_PINMUX(0, 161, 0, 246, 4)
#define PTF2_LPSPI2_SOUT_O              NXP_S32_PINMUX(0, 162, 3, 0, 0)
#define PTF2_LPSPI2_SOUT_I              NXP_S32_PINMUX(0, 162, 0, 247, 4)
#define PTF3_LPSPI2_PCS0_O              NXP_S32_PINMUX(0, 163, 3, 0, 0)
#define PTF3_LPSPI2_PCS0_I              NXP_S32_PINMUX(0, 163, 0, 241, 6)
#define PTF25_LPSPI2_PCS2_O             NXP_S32_PINMUX(0, 185, 5, 0, 0)
#define PTF25_LPSPI2_PCS2_I             NXP_S32_PINMUX(0, 185, 0, 243, 3)
#define PTF26_LPSPI2_PCS3_O             NXP_S32_PINMUX(0, 186, 5, 0, 0)
#define PTF26_LPSPI2_PCS3_I             NXP_S32_PINMUX(0, 186, 0, 244, 2)

