zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K344-257BGA-pinctrl.h
/* EMIOS_2 */
#define PTA8_EMIOS_2_CH7_H_O            NXP_S32_PINMUX(0, 8, 6, 0, 0)
#define PTA8_EMIOS_2_CH7_H_I            NXP_S32_PINMUX(0, 8, 0, 119, 3)
#define PTA14_EMIOS_2_CH18_Y_O          NXP_S32_PINMUX(0, 14, 4, 0, 0)
#define PTA14_EMIOS_2_CH18_Y_I          NXP_S32_PINMUX(0, 14, 0, 130, 4)
#define PTA18_EMIOS_2_CH0_X_O           NXP_S32_PINMUX(0, 18, 6, 0, 0)
#define PTA18_EMIOS_2_CH0_X_I           NXP_S32_PINMUX(0, 18, 0, 112, 2)
#define PTA19_EMIOS_2_CH1_H_O           NXP_S32_PINMUX(0, 19, 6, 0, 0)
#define PTA19_EMIOS_2_CH1_H_I           NXP_S32_PINMUX(0, 19, 0, 113, 2)
#define PTA20_EMIOS_2_CH2_H_O           NXP_S32_PINMUX(0, 20, 6, 0, 0)
#define PTA20_EMIOS_2_CH2_H_I           NXP_S32_PINMUX(0, 20, 0, 114, 2)
#define PTA21_EMIOS_2_CH3_H_O           NXP_S32_PINMUX(0, 21, 6, 0, 0)
#define PTA21_EMIOS_2_CH3_H_I           NXP_S32_PINMUX(0, 21, 0, 115, 2)
#define PTA25_EMIOS_2_CH8_X             NXP_S32_PINMUX(0, 23, 0, 120, 2)
#define PTA26_EMIOS_2_CH9_H_O           NXP_S32_PINMUX(0, 26, 6, 0, 0)
#define PTA26_EMIOS_2_CH9_H_I           NXP_S32_PINMUX(0, 26, 0, 121, 2)
#define PTA27_EMIOS_2_CH10_H_O          NXP_S32_PINMUX(0, 27, 6, 0, 0)
#define PTA27_EMIOS_2_CH10_H_I          NXP_S32_PINMUX(0, 27, 0, 122, 2)
#define PTA28_EMIOS_2_CH11_H_O          NXP_S32_PINMUX(0, 28, 6, 0, 0)
#define PTA28_EMIOS_2_CH11_H_I          NXP_S32_PINMUX(0, 28, 0, 123, 2)
#define PTA29_EMIOS_2_CH12_H_O          NXP_S32_PINMUX(0, 29, 6, 0, 0)
#define PTA29_EMIOS_2_CH12_H_I          NXP_S32_PINMUX(0, 29, 0, 124, 1)
#define PTA30_EMIOS_2_CH13_H_O          NXP_S32_PINMUX(0, 30, 6, 0, 0)
#define PTA30_EMIOS_2_CH13_H_I          NXP_S32_PINMUX(0, 30, 0, 125, 2)
#define PTB18_EMIOS_2_CH14_H_O          NXP_S32_PINMUX(0, 50, 5, 0, 0)
#define PTB18_EMIOS_2_CH14_H_I          NXP_S32_PINMUX(0, 50, 0, 126, 2)
#define PTB19_EMIOS_2_CH15_H_O          NXP_S32_PINMUX(0, 51, 5, 0, 0)
#define PTB19_EMIOS_2_CH15_H_I          NXP_S32_PINMUX(0, 51, 0, 127, 3)
#define PTB20_EMIOS_2_CH16_X_O          NXP_S32_PINMUX(0, 52, 5, 0, 0)
#define PTB20_EMIOS_2_CH16_X_I          NXP_S32_PINMUX(0, 52, 0, 128, 2)
#define PTB21_EMIOS_2_CH17_Y_O          NXP_S32_PINMUX(0, 53, 5, 0, 0)
#define PTB21_EMIOS_2_CH17_Y_I          NXP_S32_PINMUX(0, 53, 0, 129, 2)
#define PTB22_EMIOS_2_CH18_Y_O          NXP_S32_PINMUX(0, 54, 4, 0, 0)
#define PTB22_EMIOS_2_CH18_Y_I          NXP_S32_PINMUX(0, 54, 0, 130, 2)
#define PTB23_EMIOS_2_CH19_Y_O          NXP_S32_PINMUX(0, 55, 4, 0, 0)
#define PTB23_EMIOS_2_CH19_Y_I          NXP_S32_PINMUX(0, 55, 0, 131, 2)
#define PTB24_EMIOS_2_CH20_Y_O          NXP_S32_PINMUX(0, 56, 4, 0, 0)
#define PTB24_EMIOS_2_CH20_Y_I          NXP_S32_PINMUX(0, 56, 0, 132, 2)
#define PTB25_EMIOS_2_CH21_Y_O          NXP_S32_PINMUX(0, 57, 4, 0, 0)
#define PTB25_EMIOS_2_CH21_Y_I          NXP_S32_PINMUX(0, 57, 0, 133, 2)
#define PTB26_EMIOS_2_CH22_X_O          NXP_S32_PINMUX(0, 58, 4, 0, 0)
#define PTB26_EMIOS_2_CH22_X_I          NXP_S32_PINMUX(0, 58, 0, 134, 2)
#define PTB27_EMIOS_2_CH23_X_O          NXP_S32_PINMUX(0, 59, 4, 0, 0)
#define PTB27_EMIOS_2_CH23_X_I          NXP_S32_PINMUX(0, 59, 0, 135, 2)
#define PTB28_EMIOS_2_CH10_H_O          NXP_S32_PINMUX(0, 60, 4, 0, 0)
#define PTB28_EMIOS_2_CH10_H_I          NXP_S32_PINMUX(0, 60, 0, 122, 3)
#define PTB29_EMIOS_2_CH11_H_O          NXP_S32_PINMUX(0, 61, 4, 0, 0)
#define PTB29_EMIOS_2_CH11_H_I          NXP_S32_PINMUX(0, 61, 0, 123, 3)
#define PTC16_EMIOS_2_CH9_H_O           NXP_S32_PINMUX(0, 80, 3, 0, 0)
#define PTC16_EMIOS_2_CH9_H_I           NXP_S32_PINMUX(0, 80, 0, 121, 4)
#define PTC18_EMIOS_2_CH12_H_O          NXP_S32_PINMUX(0, 82, 4, 0, 0)
#define PTC18_EMIOS_2_CH12_H_I          NXP_S32_PINMUX(0, 82, 0, 124, 3)
#define PTC19_EMIOS_2_CH13_H_O          NXP_S32_PINMUX(0, 83, 4, 0, 0)
#define PTC19_EMIOS_2_CH13_H_I          NXP_S32_PINMUX(0, 83, 0, 125, 3)
#define PTC20_EMIOS_2_CH14_H_O          NXP_S32_PINMUX(0, 84, 4, 0, 0)
#define PTC20_EMIOS_2_CH14_H_I          NXP_S32_PINMUX(0, 84, 0, 126, 3)
#define PTC21_EMIOS_2_CH15_H_O          NXP_S32_PINMUX(0, 85, 4, 0, 0)
#define PTC21_EMIOS_2_CH15_H_I          NXP_S32_PINMUX(0, 85, 0, 127, 5)
#define PTC24_EMIOS_2_CH0_X_O           NXP_S32_PINMUX(0, 88, 4, 0, 0)
#define PTC24_EMIOS_2_CH0_X_I           NXP_S32_PINMUX(0, 88, 0, 112, 5)
#define PTC25_EMIOS_2_CH1_H_O           NXP_S32_PINMUX(0, 89, 4, 0, 0)
#define PTC25_EMIOS_2_CH1_H_I           NXP_S32_PINMUX(0, 89, 0, 113, 3)
#define PTC26_EMIOS_2_CH2_H_O           NXP_S32_PINMUX(0, 90, 4, 0, 0)
#define PTC26_EMIOS_2_CH2_H_I           NXP_S32_PINMUX(0, 90, 0, 114, 3)
#define PTC27_EMIOS_2_CH3_H_O           NXP_S32_PINMUX(0, 91, 4, 0, 0)
#define PTC27_EMIOS_2_CH3_H_I           NXP_S32_PINMUX(0, 91, 0, 115, 3)
#define PTC29_EMIOS_2_CH4_H_O           NXP_S32_PINMUX(0, 93, 4, 0, 0)
#define PTC29_EMIOS_2_CH4_H_I           NXP_S32_PINMUX(0, 93, 0, 116, 2)
#define PTC30_EMIOS_2_CH5_H_O           NXP_S32_PINMUX(0, 94, 4, 0, 0)
#define PTC30_EMIOS_2_CH5_H_I           NXP_S32_PINMUX(0, 94, 0, 117, 3)
#define PTC31_EMIOS_2_CH6_H_O           NXP_S32_PINMUX(0, 95, 5, 0, 0)
#define PTC31_EMIOS_2_CH6_H_I           NXP_S32_PINMUX(0, 95, 0, 118, 2)
#define PTD20_EMIOS_2_CH0_X_O           NXP_S32_PINMUX(0, 116, 4, 0, 0)
#define PTD20_EMIOS_2_CH0_X_I           NXP_S32_PINMUX(0, 116, 0, 112, 3)
#define PTD21_EMIOS_2_CH8_X_O           NXP_S32_PINMUX(0, 117, 4, 0, 0)
#define PTD21_EMIOS_2_CH8_X_I           NXP_S32_PINMUX(0, 117, 0, 120, 3)
#define PTD22_EMIOS_2_CH22_X_O          NXP_S32_PINMUX(0, 118, 4, 0, 0)
#define PTD22_EMIOS_2_CH22_X_I          NXP_S32_PINMUX(0, 118, 0, 134, 3)
#define PTD23_EMIOS_2_CH23_X_O          NXP_S32_PINMUX(0, 119, 4, 0, 0)
#define PTD23_EMIOS_2_CH23_X_I          NXP_S32_PINMUX(0, 119, 0, 135, 3)
#define PTD26_EMIOS_2_CH7_H_O           NXP_S32_PINMUX(0, 122, 4, 0, 0)
#define PTD26_EMIOS_2_CH7_H_I           NXP_S32_PINMUX(0, 122, 0, 119, 1)
#define PTD27_EMIOS_2_CH9_H_O           NXP_S32_PINMUX(0, 123, 4, 0, 0)
#define PTD27_EMIOS_2_CH9_H_I           NXP_S32_PINMUX(0, 123, 0, 121, 3)
#define PTD28_EMIOS_2_CH0_X_O           NXP_S32_PINMUX(0, 124, 4, 0, 0)
#define PTD28_EMIOS_2_CH0_X_I           NXP_S32_PINMUX(0, 124, 0, 112, 4)
#define PTD29_EMIOS_2_CH8_X_O           NXP_S32_PINMUX(0, 125, 4, 0, 0)
#define PTD29_EMIOS_2_CH8_X_I           NXP_S32_PINMUX(0, 125, 0, 120, 4)
#define PTD30_EMIOS_2_CH16_X_O          NXP_S32_PINMUX(0, 126, 4, 0, 0)
#define PTD30_EMIOS_2_CH16_X_I          NXP_S32_PINMUX(0, 126, 0, 128, 3)
#define PTD31_EMIOS_2_CH22_X_O          NXP_S32_PINMUX(0, 127, 4, 0, 0)
#define PTD31_EMIOS_2_CH22_X_I          NXP_S32_PINMUX(0, 127, 0, 134, 4)
#define PTE17_EMIOS_2_CH23_X_O          NXP_S32_PINMUX(0, 145, 4, 0, 0)
#define PTE17_EMIOS_2_CH23_X_I          NXP_S32_PINMUX(0, 145, 0, 135, 4)
#define PTE18_EMIOS_2_CH17_Y_O          NXP_S32_PINMUX(0, 146, 4, 0, 0)
#define PTE18_EMIOS_2_CH17_Y_I          NXP_S32_PINMUX(0, 146, 0, 129, 4)
#define PTE21_EMIOS_2_CH19_Y_O          NXP_S32_PINMUX(0, 149, 4, 0, 0)
#define PTE21_EMIOS_2_CH19_Y_I          NXP_S32_PINMUX(0, 149, 0, 131, 4)
#define PTE22_EMIOS_2_CH20_Y_O          NXP_S32_PINMUX(0, 150, 4, 0, 0)
#define PTE22_EMIOS_2_CH20_Y_I          NXP_S32_PINMUX(0, 150, 0, 132, 4)
#define PTE23_EMIOS_2_CH21_Y_O          NXP_S32_PINMUX(0, 151, 4, 0, 0)
#define PTE23_EMIOS_2_CH21_Y_I          NXP_S32_PINMUX(0, 151, 0, 133, 4)
#define PTE24_EMIOS_2_CH4_H_O           NXP_S32_PINMUX(0, 152, 4, 0, 0)
#define PTE24_EMIOS_2_CH4_H_I           NXP_S32_PINMUX(0, 152, 0, 116, 3)
#define PTE25_EMIOS_2_CH5_H_O           NXP_S32_PINMUX(0, 153, 4, 0, 0)
#define PTE25_EMIOS_2_CH5_H_I           NXP_S32_PINMUX(0, 153, 0, 117, 2)
#define PTE26_EMIOS_2_CH6_H_O           NXP_S32_PINMUX(0, 154, 4, 0, 0)
#define PTE26_EMIOS_2_CH6_H_I           NXP_S32_PINMUX(0, 154, 0, 118, 3)
#define PTF0_EMIOS_2_CH0_X_O            NXP_S32_PINMUX(0, 160, 2, 0, 0)
#define PTF0_EMIOS_2_CH0_X_I            NXP_S32_PINMUX(0, 160, 0, 112, 1)
#define PTF1_EMIOS_2_CH1_H_O            NXP_S32_PINMUX(0, 161, 2, 0, 0)
#define PTF1_EMIOS_2_CH1_H_I            NXP_S32_PINMUX(0, 161, 0, 113, 1)
#define PTF2_EMIOS_2_CH2_H_O            NXP_S32_PINMUX(0, 162, 2, 0, 0)
#define PTF2_EMIOS_2_CH2_H_I            NXP_S32_PINMUX(0, 162, 0, 114, 1)
#define PTF3_EMIOS_2_CH3_H_O            NXP_S32_PINMUX(0, 163, 2, 0, 0)
#define PTF3_EMIOS_2_CH3_H_I            NXP_S32_PINMUX(0, 163, 0, 115, 1)
#define PTF4_EMIOS_2_CH4_H_O            NXP_S32_PINMUX(0, 164, 2, 0, 0)
#define PTF4_EMIOS_2_CH4_H_I            NXP_S32_PINMUX(0, 164, 0, 116, 1)
#define PTF5_EMIOS_2_CH5_H_O            NXP_S32_PINMUX(0, 165, 2, 0, 0)
#define PTF5_EMIOS_2_CH5_H_I            NXP_S32_PINMUX(0, 165, 0, 117, 1)
#define PTF6_EMIOS_2_CH6_H_O            NXP_S32_PINMUX(0, 166, 2, 0, 0)
#define PTF6_EMIOS_2_CH6_H_I            NXP_S32_PINMUX(0, 166, 0, 118, 1)
#define PTF7_EMIOS_2_CH7_H_O            NXP_S32_PINMUX(0, 167, 2, 0, 0)
#define PTF7_EMIOS_2_CH7_H_I            NXP_S32_PINMUX(0, 167, 0, 119, 2)
#define PTF8_EMIOS_2_CH8_X_O            NXP_S32_PINMUX(0, 168, 2, 0, 0)
#define PTF8_EMIOS_2_CH8_X_I            NXP_S32_PINMUX(0, 168, 0, 120, 1)
#define PTF9_EMIOS_2_CH9_H_O            NXP_S32_PINMUX(0, 169, 2, 0, 0)
#define PTF9_EMIOS_2_CH9_H_I            NXP_S32_PINMUX(0, 169, 0, 121, 1)
#define PTF10_EMIOS_2_CH10_H_O          NXP_S32_PINMUX(0, 170, 2, 0, 0)
#define PTF10_EMIOS_2_CH10_H_I          NXP_S32_PINMUX(0, 170, 0, 122, 1)
#define PTF11_EMIOS_2_CH11_H_O          NXP_S32_PINMUX(0, 171, 2, 0, 0)
#define PTF11_EMIOS_2_CH11_H_I          NXP_S32_PINMUX(0, 171, 0, 123, 1)
#define PTF12_EMIOS_2_CH12_H_O          NXP_S32_PINMUX(0, 172, 2, 0, 0)
#define PTF12_EMIOS_2_CH12_H_I          NXP_S32_PINMUX(0, 172, 0, 124, 2)
#define PTF13_EMIOS_2_CH13_H_O          NXP_S32_PINMUX(0, 173, 2, 0, 0)
#define PTF13_EMIOS_2_CH13_H_I          NXP_S32_PINMUX(0, 173, 0, 125, 1)
#define PTF14_EMIOS_2_CH14_H_O          NXP_S32_PINMUX(0, 174, 2, 0, 0)
#define PTF14_EMIOS_2_CH14_H_I          NXP_S32_PINMUX(0, 174, 0, 126, 1)
#define PTF15_EMIOS_2_CH15_H_O          NXP_S32_PINMUX(0, 175, 2, 0, 0)
#define PTF15_EMIOS_2_CH15_H_I          NXP_S32_PINMUX(0, 175, 0, 127, 1)
#define PTF16_EMIOS_2_CH16_X_O          NXP_S32_PINMUX(0, 176, 2, 0, 0)
#define PTF16_EMIOS_2_CH16_X_I          NXP_S32_PINMUX(0, 176, 0, 128, 4)
#define PTF17_EMIOS_2_CH17_Y_O          NXP_S32_PINMUX(0, 177, 2, 0, 0)
#define PTF17_EMIOS_2_CH17_Y_I          NXP_S32_PINMUX(0, 177, 0, 129, 3)
#define PTF18_EMIOS_2_CH18_Y_O          NXP_S32_PINMUX(0, 178, 2, 0, 0)
#define PTF18_EMIOS_2_CH18_Y_I          NXP_S32_PINMUX(0, 178, 0, 130, 3)
#define PTF19_EMIOS_2_CH19_Y_O          NXP_S32_PINMUX(0, 179, 2, 0, 0)
#define PTF19_EMIOS_2_CH19_Y_I          NXP_S32_PINMUX(0, 179, 0, 131, 3)
#define PTF20_EMIOS_2_CH20_Y_O          NXP_S32_PINMUX(0, 180, 2, 0, 0)
#define PTF20_EMIOS_2_CH20_Y_I          NXP_S32_PINMUX(0, 180, 0, 132, 3)
#define PTF21_EMIOS_2_CH21_Y_O          NXP_S32_PINMUX(0, 181, 2, 0, 0)
#define PTF21_EMIOS_2_CH21_Y_I          NXP_S32_PINMUX(0, 181, 0, 133, 3)
#define PTF22_EMIOS_2_CH22_X_O          NXP_S32_PINMUX(0, 182, 2, 0, 0)
#define PTF22_EMIOS_2_CH22_X_I          NXP_S32_PINMUX(0, 182, 0, 134, 5)
#define PTF23_EMIOS_2_CH23_X_O          NXP_S32_PINMUX(0, 183, 2, 0, 0)
#define PTF23_EMIOS_2_CH23_X_I          NXP_S32_PINMUX(0, 183, 0, 135, 5)
#define PTG15_EMIOS_2_CH15_H_O          NXP_S32_PINMUX(0, 207, 5, 0, 0)
#define PTG15_EMIOS_2_CH15_H_I          NXP_S32_PINMUX(0, 207, 0, 127, 4)
#define PTG16_EMIOS_2_CH16_X_O          NXP_S32_PINMUX(0, 208, 2, 0, 0)
#define PTG16_EMIOS_2_CH16_X_I          NXP_S32_PINMUX(0, 208, 0, 128, 1)
#define PTG17_EMIOS_2_CH17_Y_O          NXP_S32_PINMUX(0, 209, 2, 0, 0)
#define PTG17_EMIOS_2_CH17_Y_I          NXP_S32_PINMUX(0, 209, 0, 129, 1)
#define PTG18_EMIOS_2_CH18_Y_O          NXP_S32_PINMUX(0, 210, 2, 0, 0)
#define PTG18_EMIOS_2_CH18_Y_I          NXP_S32_PINMUX(0, 210, 0, 130, 1)
#define PTG19_EMIOS_2_CH19_Y_O          NXP_S32_PINMUX(0, 211, 2, 0, 0)
#define PTG19_EMIOS_2_CH19_Y_I          NXP_S32_PINMUX(0, 211, 0, 131, 1)
#define PTG20_EMIOS_2_CH20_Y_O          NXP_S32_PINMUX(0, 212, 2, 0, 0)
#define PTG20_EMIOS_2_CH20_Y_I          NXP_S32_PINMUX(0, 212, 0, 132, 1)
#define PTG21_EMIOS_2_CH21_Y_O          NXP_S32_PINMUX(0, 213, 2, 0, 0)
#define PTG21_EMIOS_2_CH21_Y_I          NXP_S32_PINMUX(0, 213, 0, 133, 1)
#define PTG22_EMIOS_2_CH22_X_O          NXP_S32_PINMUX(0, 214, 2, 0, 0)
#define PTG22_EMIOS_2_CH22_X_I          NXP_S32_PINMUX(0, 214, 0, 134, 1)
#define PTG23_EMIOS_2_CH23_X_O          NXP_S32_PINMUX(0, 215, 2, 0, 0)
#define PTG23_EMIOS_2_CH23_X_I          NXP_S32_PINMUX(0, 215, 0, 135, 1)

/* LPUART2 */
#define PTA8_LPUART2_RX                 NXP_S32_PINMUX(0, 8, 0, 189, 3)
#define PTA9_LPUART2_TX_O               NXP_S32_PINMUX(0, 9, 2, 0, 0)
#define PTA9_LPUART2_TX_I               NXP_S32_PINMUX(0, 9, 0, 365, 1)
#define PTA29_LPUART2_TX_O              NXP_S32_PINMUX(0, 29, 4, 0, 0)
#define PTA29_LPUART2_TX_I              NXP_S32_PINMUX(0, 29, 0, 365, 5)
#define PTA30_LPUART2_RX                NXP_S32_PINMUX(0, 30, 0, 189, 4)
#define PTC15_LPUART2_TX_O              NXP_S32_PINMUX(0, 79, 5, 0, 0)
#define PTC15_LPUART2_TX_I              NXP_S32_PINMUX(0, 79, 0, 365, 2)
#define PTC16_LPUART2_RX                NXP_S32_PINMUX(0, 80, 0, 189, 5)
#define PTD6_LPUART2_RX                 NXP_S32_PINMUX(0, 102, 0, 189, 1)
#define PTD7_LPUART2_TX_O               NXP_S32_PINMUX(0, 103, 2, 0, 0)
#define PTD7_LPUART2_TX_I               NXP_S32_PINMUX(0, 103, 0, 365, 3)
#define PTD11_LPUART2_CTS               NXP_S32_PINMUX(0, 107, 0, 362, 1)
#define PTD12_LPUART2_RTS               NXP_S32_PINMUX(0, 108, 3, 0, 0)
#define PTD15_LPUART2_CTS               NXP_S32_PINMUX(0, 111, 0, 362, 2)
#define PTD16_LPUART2_RTS               NXP_S32_PINMUX(0, 112, 6, 0, 0)
#define PTD17_LPUART2_RX                NXP_S32_PINMUX(0, 113, 0, 189, 2)
#define PTE3_LPUART2_RTS                NXP_S32_PINMUX(0, 131, 5, 0, 0)
#define PTE9_LPUART2_CTS                NXP_S32_PINMUX(0, 137, 0, 362, 3)
#define PTE12_LPUART2_TX_O              NXP_S32_PINMUX(0, 140, 3, 0, 0)
#define PTE12_LPUART2_TX_I              NXP_S32_PINMUX(0, 140, 0, 365, 4)

/* CMP2 */
#define PTA9_CMP2_OUT                   NXP_S32_PINMUX(0, 9, 7, 0, 0)
#define PTC5_CMP2_RRT                   NXP_S32_PINMUX(0, 69, 5, 0, 0)
#define PTG4_CMP2_OUT                   NXP_S32_PINMUX(0, 196, 4, 0, 0)
#define PTG5_CMP2_RRT                   NXP_S32_PINMUX(0, 197, 4, 0, 0)

/* JTAGTRACENOETM */
#define PTA10_JTAG_TDOTRACENOETM_SWO    NXP_S32_PINMUX(0, 10, 7, 0, 0)

