zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K344-257BGA-pinctrl.h
/* CAN1 */
#define PTA11_CAN1_TX                   NXP_S32_PINMUX(0, 11, 1, 0, 0)
#define PTA12_CAN1_RX                   NXP_S32_PINMUX(0, 12, 0, 1, 2)
#define PTA22_CAN1_RX                   NXP_S32_PINMUX(0, 22, 0, 1, 3)
#define PTA23_CAN1_TX                   NXP_S32_PINMUX(0, 23, 1, 0, 0)
#define PTB22_CAN1_TX                   NXP_S32_PINMUX(0, 54, 1, 0, 0)
#define PTB23_CAN1_RX                   NXP_S32_PINMUX(0, 55, 0, 1, 4)
#define PTC8_CAN1_TX                    NXP_S32_PINMUX(0, 72, 3, 0, 0)
#define PTC9_CAN1_RX                    NXP_S32_PINMUX(0, 73, 0, 1, 1)
#define PTF14_CAN1_TX                   NXP_S32_PINMUX(0, 174, 1, 0, 0)
#define PTF15_CAN1_RX                   NXP_S32_PINMUX(0, 175, 0, 1, 5)

/* CMP1 */
#define PTA12_CMP1_OUT                  NXP_S32_PINMUX(0, 12, 7, 0, 0)
#define PTE15_CMP1_RRT                  NXP_S32_PINMUX(0, 143, 5, 0, 0)
#define PTE30_CMP1_OUT                  NXP_S32_PINMUX(0, 158, 2, 0, 0)
#define PTE31_CMP1_RRT                  NXP_S32_PINMUX(0, 159, 2, 0, 0)

/* LPUART11 */
#define PTA12_LPUART11_RX               NXP_S32_PINMUX(0, 12, 0, 198, 2)
#define PTA13_LPUART11_TX_O             NXP_S32_PINMUX(0, 13, 7, 0, 0)
#define PTA13_LPUART11_TX_I             NXP_S32_PINMUX(0, 13, 0, 374, 1)
#define PTC10_LPUART11_TX_O             NXP_S32_PINMUX(0, 74, 2, 0, 0)
#define PTC10_LPUART11_TX_I             NXP_S32_PINMUX(0, 74, 0, 374, 2)
#define PTC11_LPUART11_RX               NXP_S32_PINMUX(0, 75, 0, 198, 1)
#define PTF27_LPUART11_TX_O             NXP_S32_PINMUX(0, 187, 1, 0, 0)
#define PTF27_LPUART11_TX_I             NXP_S32_PINMUX(0, 187, 0, 374, 3)
#define PTF28_LPUART11_RX               NXP_S32_PINMUX(0, 188, 0, 198, 3)

/* LPUART6 */
#define PTA15_LPUART6_RX                NXP_S32_PINMUX(0, 15, 0, 193, 2)
#define PTA16_LPUART6_TX_O              NXP_S32_PINMUX(0, 16, 5, 0, 0)
#define PTA16_LPUART6_TX_I              NXP_S32_PINMUX(0, 16, 0, 369, 1)
#define PTB29_LPUART6_TX_O              NXP_S32_PINMUX(0, 61, 1, 0, 0)
#define PTB29_LPUART6_TX_I              NXP_S32_PINMUX(0, 61, 0, 369, 3)
#define PTC18_LPUART6_RX                NXP_S32_PINMUX(0, 82, 0, 193, 4)
#define PTD8_LPUART6_RX                 NXP_S32_PINMUX(0, 104, 0, 193, 1)
#define PTD9_LPUART6_TX_O               NXP_S32_PINMUX(0, 105, 4, 0, 0)
#define PTD9_LPUART6_TX_I               NXP_S32_PINMUX(0, 105, 0, 369, 2)
#define PTF2_LPUART6_TX_O               NXP_S32_PINMUX(0, 162, 1, 0, 0)
#define PTF2_LPUART6_TX_I               NXP_S32_PINMUX(0, 162, 0, 369, 4)
#define PTF3_LPUART6_RX                 NXP_S32_PINMUX(0, 163, 0, 193, 3)

/* LPUART4 */
#define PTA17_LPUART4_TX_O              NXP_S32_PINMUX(0, 17, 4, 0, 0)
#define PTA17_LPUART4_TX_I              NXP_S32_PINMUX(0, 17, 0, 367, 1)
#define PTB16_LPUART4_TX_O              NXP_S32_PINMUX(0, 48, 4, 0, 0)
#define PTB16_LPUART4_TX_I              NXP_S32_PINMUX(0, 48, 0, 367, 2)
#define PTB17_LPUART4_RX                NXP_S32_PINMUX(0, 49, 0, 191, 3)
#define PTE7_LPUART4_RX                 NXP_S32_PINMUX(0, 135, 0, 191, 4)
#define PTE10_LPUART4_RX                NXP_S32_PINMUX(0, 138, 0, 191, 2)
#define PTE11_LPUART4_TX_O              NXP_S32_PINMUX(0, 139, 1, 0, 0)
#define PTE11_LPUART4_TX_I              NXP_S32_PINMUX(0, 139, 0, 367, 3)

/* EMAC */
#define PTA26_EMAC_PPS0_O               NXP_S32_PINMUX(0, 26, 7, 0, 0)
#define PTA26_EMAC_PPS0_I               NXP_S32_PINMUX(0, 26, 0, 144, 3)
#define PTA27_EMAC_PPS1_O               NXP_S32_PINMUX(0, 27, 3, 0, 0)
#define PTA27_EMAC_PPS1_I               NXP_S32_PINMUX(0, 27, 0, 145, 3)
#define PTA29_EMAC_PPS2_O               NXP_S32_PINMUX(0, 29, 3, 0, 0)
#define PTA29_EMAC_PPS2_I               NXP_S32_PINMUX(0, 29, 0, 146, 3)
#define PTB4_EMAC_MII_RMII_TXD1         NXP_S32_PINMUX(0, 36, 1, 0, 0)
#define PTB4_EMAC_MII_RMII_MDIO_O       NXP_S32_PINMUX(0, 36, 5, 0, 0)
#define PTB4_EMAC_MII_RMII_MDIO_I       NXP_S32_PINMUX(0, 36, 0, 291, 1)
#define PTB5_EMAC_MII_RMII_TXD0         NXP_S32_PINMUX(0, 37, 1, 0, 0)
#define PTB5_EMAC_MII_RMII_MDC          NXP_S32_PINMUX(0, 37, 7, 0, 0)
#define PTB22_EMAC_MII_CRS              NXP_S32_PINMUX(0, 54, 0, 290, 1)
#define PTB23_EMAC_MII_COL              NXP_S32_PINMUX(0, 55, 0, 289, 1)
#define PTB28_EMAC_PPS3_O               NXP_S32_PINMUX(0, 60, 7, 0, 0)
#define PTB28_EMAC_PPS3_I               NXP_S32_PINMUX(0, 60, 0, 147, 2)
#define PTC0_EMAC_MII_RMII_RXD0         NXP_S32_PINMUX(0, 64, 0, 294, 2)
#define PTC0_EMAC_MII_RMII_RXD1         NXP_S32_PINMUX(0, 64, 0, 295, 1)
#define PTC0_EMAC_MII_RMII_TX_CLK       NXP_S32_PINMUX(0, 64, 0, 296, 4)
#define PTC1_EMAC_MII_RMII_RXD0         NXP_S32_PINMUX(0, 65, 0, 294, 1)
#define PTC1_EMAC_MII_RMII_RXD1         NXP_S32_PINMUX(0, 65, 0, 295, 2)
#define PTC1_EMAC_MII_RX_CLK            NXP_S32_PINMUX(0, 65, 0, 300, 3)
#define PTC2_EMAC_MII_RMII_TXD1         NXP_S32_PINMUX(0, 66, 1, 0, 0)
#define PTC2_EMAC_MII_RMII_TXD0         NXP_S32_PINMUX(0, 66, 5, 0, 0)
#define PTC14_EMAC_MII_COL              NXP_S32_PINMUX(0, 78, 0, 289, 2)
#define PTC14_EMAC_MII_RMII_RX_ER       NXP_S32_PINMUX(0, 78, 0, 293, 2)
#define PTC14_EMAC_MII_RXD3             NXP_S32_PINMUX(0, 78, 0, 302, 2)
#define PTC15_EMAC_MII_CRS              NXP_S32_PINMUX(0, 79, 0, 290, 2)
#define PTC15_EMAC_MII_RMII_RX_DV       NXP_S32_PINMUX(0, 79, 0, 292, 2)
#define PTC15_EMAC_MII_RXD2             NXP_S32_PINMUX(0, 79, 0, 301, 2)
#define PTC16_EMAC_MII_RMII_RX_ER       NXP_S32_PINMUX(0, 80, 0, 293, 1)
#define PTC17_EMAC_MII_RMII_RX_DV       NXP_S32_PINMUX(0, 81, 0, 292, 1)
#define PTD5_EMAC_MII_TXD2              NXP_S32_PINMUX(0, 101, 1, 0, 0)
#define PTD5_EMAC_MII_TXD3              NXP_S32_PINMUX(0, 101, 5, 0, 0)
#define PTD5_EMAC_MII_RX_CLK            NXP_S32_PINMUX(0, 101, 0, 300, 2)
#define PTD6_EMAC_MII_TXD3              NXP_S32_PINMUX(0, 102, 1, 0, 0)
#define PTD6_EMAC_MII_TXD2              NXP_S32_PINMUX(0, 102, 5, 0, 0)
#define PTD6_EMAC_MII_RMII_TX_CLK       NXP_S32_PINMUX(0, 102, 0, 296, 2)
#define PTD7_EMAC_MII_RMII_TXD0         NXP_S32_PINMUX(0, 103, 1, 0, 0)
#define PTD7_EMAC_MII_RMII_TXD1         NXP_S32_PINMUX(0, 103, 5, 0, 0)
#define PTD8_EMAC_MII_RMII_RXD1         NXP_S32_PINMUX(0, 104, 0, 295, 3)
#define PTD8_EMAC_MII_RXD3              NXP_S32_PINMUX(0, 104, 0, 302, 1)
#define PTD9_EMAC_MII_RMII_RXD0         NXP_S32_PINMUX(0, 105, 0, 294, 3)
#define PTD9_EMAC_MII_RXD2              NXP_S32_PINMUX(0, 105, 0, 301, 1)
#define PTD10_EMAC_MII_TXD3             NXP_S32_PINMUX(0, 106, 1, 0, 0)
#define PTD10_EMAC_MII_RX_CLK           NXP_S32_PINMUX(0, 106, 0, 300, 1)
#define PTD11_EMAC_MII_TXD2             NXP_S32_PINMUX(0, 107, 1, 0, 0)
#define PTD11_EMAC_MII_RMII_TX_EN       NXP_S32_PINMUX(0, 107, 3, 0, 0)
#define PTD11_EMAC_MII_RMII_TX_CLK      NXP_S32_PINMUX(0, 107, 0, 296, 1)
#define PTD12_EMAC_MII_RMII_TX_EN       NXP_S32_PINMUX(0, 108, 5, 0, 0)
#define PTD12_EMAC_MII_RMII_TX_CLK      NXP_S32_PINMUX(0, 108, 0, 296, 3)
#define PTD13_EMAC_PPS1_O               NXP_S32_PINMUX(0, 109, 5, 0, 0)
#define PTD13_EMAC_PPS1_I               NXP_S32_PINMUX(0, 109, 0, 145, 2)
#define PTD14_EMAC_PPS0_O               NXP_S32_PINMUX(0, 110, 5, 0, 0)
#define PTD14_EMAC_PPS0_I               NXP_S32_PINMUX(0, 110, 0, 144, 2)
#define PTD15_EMAC_PPS2_O               NXP_S32_PINMUX(0, 111, 5, 0, 0)
#define PTD15_EMAC_PPS2_I               NXP_S32_PINMUX(0, 111, 0, 146, 2)
#define PTD16_EMAC_MII_RMII_MDIO_O      NXP_S32_PINMUX(0, 112, 3, 0, 0)
#define PTD16_EMAC_MII_RMII_MDIO_I      NXP_S32_PINMUX(0, 112, 0, 291, 2)
#define PTD17_EMAC_MII_RMII_MDC         NXP_S32_PINMUX(0, 113, 3, 0, 0)
#define PTD17_EMAC_PPS2_O               NXP_S32_PINMUX(0, 113, 7, 0, 0)
#define PTD17_EMAC_PPS2_I               NXP_S32_PINMUX(0, 113, 0, 146, 1)
#define PTE3_EMAC_PPS0_O                NXP_S32_PINMUX(0, 131, 6, 0, 0)
#define PTE3_EMAC_PPS0_I                NXP_S32_PINMUX(0, 131, 0, 144, 1)
#define PTE8_EMAC_MII_RMII_MDC          NXP_S32_PINMUX(0, 136, 5, 0, 0)
#define PTE9_EMAC_PPS3_O                NXP_S32_PINMUX(0, 137, 5, 0, 0)
#define PTE9_EMAC_MII_RMII_TX_EN        NXP_S32_PINMUX(0, 137, 6, 0, 0)
#define PTE9_EMAC_PPS3_I                NXP_S32_PINMUX(0, 137, 0, 147, 1)
#define PTE12_EMAC_PPS3_O               NXP_S32_PINMUX(0, 140, 5, 0, 0)
#define PTE12_EMAC_PPS3_I               NXP_S32_PINMUX(0, 140, 0, 147, 3)
#define PTE14_EMAC_PPS1_O               NXP_S32_PINMUX(0, 142, 7, 0, 0)
#define PTE14_EMAC_PPS1_I               NXP_S32_PINMUX(0, 142, 0, 145, 1)

/* LPI2C0 */
#define PTB0_LPI2C0_SDAS_O              NXP_S32_PINMUX(0, 32, 1, 0, 0)
#define PTB0_LPI2C0_SDAS_I              NXP_S32_PINMUX(0, 32, 0, 215, 1)
#define PTB1_LPI2C0_SCLS_O              NXP_S32_PINMUX(0, 33, 1, 0, 0)
#define PTB1_LPI2C0_SCLS_I              NXP_S32_PINMUX(0, 33, 0, 213, 1)
#define PTB11_LPI2C0_HREQ               NXP_S32_PINMUX(0, 43, 0, 211, 1)
#define PTC7_LPI2C0_HREQ                NXP_S32_PINMUX(0, 71, 0, 211, 2)
#define PTC8_LPI2C0_SCL_O               NXP_S32_PINMUX(0, 72, 1, 0, 0)
#define PTC8_LPI2C0_SCL_I               NXP_S32_PINMUX(0, 72, 0, 212, 1)
#define PTC9_LPI2C0_SDA_O               NXP_S32_PINMUX(0, 73, 1, 0, 0)
#define PTC9_LPI2C0_SDA_I               NXP_S32_PINMUX(0, 73, 0, 214, 1)
#define PTD13_LPI2C0_SDA_O              NXP_S32_PINMUX(0, 109, 4, 0, 0)
#define PTD13_LPI2C0_SDA_I              NXP_S32_PINMUX(0, 109, 0, 214, 2)
#define PTD14_LPI2C0_SCL_O              NXP_S32_PINMUX(0, 110, 4, 0, 0)
#define PTD14_LPI2C0_SCL_I              NXP_S32_PINMUX(0, 110, 0, 212, 2)
#define PTF20_LPI2C0_SCL_O              NXP_S32_PINMUX(0, 180, 4, 0, 0)
#define PTF20_LPI2C0_SCL_I              NXP_S32_PINMUX(0, 180, 0, 212, 3)
#define PTF21_LPI2C0_SDA_O              NXP_S32_PINMUX(0, 181, 4, 0, 0)
#define PTF21_LPI2C0_SDA_I              NXP_S32_PINMUX(0, 181, 0, 214, 3)

/* LCU1 */
#define PTB0_LCU1_OUT5                  NXP_S32_PINMUX(0, 32, 5, 0, 0)
#define PTB1_LCU1_OUT4                  NXP_S32_PINMUX(0, 33, 7, 0, 0)
#define PTB2_LCU1_OUT3                  NXP_S32_PINMUX(0, 34, 5, 0, 0)
#define PTB3_LCU1_OUT2                  NXP_S32_PINMUX(0, 35, 6, 0, 0)
#define PTB28_LCU1_OUT11                NXP_S32_PINMUX(0, 60, 6, 0, 0)
#define PTB29_LCU1_OUT10                NXP_S32_PINMUX(0, 61, 6, 0, 0)
#define PTC8_LCU1_OUT7                  NXP_S32_PINMUX(0, 72, 5, 0, 0)
#define PTC9_LCU1_OUT6                  NXP_S32_PINMUX(0, 73, 5, 0, 0)
#define PTC10_LCU1_OUT11                NXP_S32_PINMUX(0, 74, 6, 0, 0)
#define PTC11_LCU1_OUT10                NXP_S32_PINMUX(0, 75, 7, 0, 0)
#define PTC12_LCU1_OUT9                 NXP_S32_PINMUX(0, 76, 6, 0, 0)
#define PTC13_LCU1_OUT8                 NXP_S32_PINMUX(0, 77, 6, 0, 0)
#define PTC14_LCU1_OUT1                 NXP_S32_PINMUX(0, 78, 6, 0, 0)
#define PTC15_LCU1_OUT0                 NXP_S32_PINMUX(0, 79, 6, 0, 0)
#define PTC18_LCU1_OUT7                 NXP_S32_PINMUX(0, 82, 6, 0, 0)
#define PTC19_LCU1_OUT6                 NXP_S32_PINMUX(0, 83, 6, 0, 0)
#define PTC20_LCU1_OUT5                 NXP_S32_PINMUX(0, 84, 6, 0, 0)
#define PTC21_LCU1_OUT4                 NXP_S32_PINMUX(0, 85, 6, 0, 0)
#define PTC23_LCU1_OUT0                 NXP_S32_PINMUX(0, 87, 6, 0, 0)
#define PTC24_LCU1_OUT1                 NXP_S32_PINMUX(0, 88, 6, 0, 0)
#define PTC25_LCU1_OUT2                 NXP_S32_PINMUX(0, 89, 6, 0, 0)
#define PTC26_LCU1_OUT9                 NXP_S32_PINMUX(0, 90, 6, 0, 0)
#define PTC27_LCU1_OUT3                 NXP_S32_PINMUX(0, 91, 6, 0, 0)
#define PTC28_LCU1_OUT8                 NXP_S32_PINMUX(0, 92, 6, 0, 0)

/* HSE */
#define PTB0_HSE_TAMPER_LOOP_OUT0       NXP_S32_PINMUX(0, 32, 7, 0, 0)
#define PTB1_HSE_TAMPER_EXTIN0          NXP_S32_PINMUX(0, 33, 0, 343, 1)
#define PTB30_HSE_TAMPER_LOOP_OUT0      NXP_S32_PINMUX(0, 62, 5, 0, 0)
#define PTB31_HSE_TAMPER_EXTIN0         NXP_S32_PINMUX(0, 63, 0, 343, 3)
#define PTD23_HSE_TAMPER_LOOP_OUT0      NXP_S32_PINMUX(0, 119, 5, 0, 0)
#define PTD24_HSE_TAMPER_EXTIN0         NXP_S32_PINMUX(0, 120, 0, 343, 2)
#define PTF11_HSE_TAMPER_EXTIN0         NXP_S32_PINMUX(0, 171, 0, 343, 4)
#define PTF19_HSE_TAMPER_LOOP_OUT0      NXP_S32_PINMUX(0, 179, 6, 0, 0)

/* ADC1 */
#define PTB2_ADC1_MA0                   NXP_S32_PINMUX(0, 34, 1, 0, 0)
#define PTB23_ADC1_MA0                  NXP_S32_PINMUX(0, 55, 1, 0, 0)
#define PTB24_ADC1_MA1                  NXP_S32_PINMUX(0, 56, 1, 0, 0)
#define PTB28_ADC1_MA2                  NXP_S32_PINMUX(0, 60, 1, 0, 0)
#define PTC12_ADC1_MA2                  NXP_S32_PINMUX(0, 76, 1, 0, 0)
#define PTC13_ADC1_MA1                  NXP_S32_PINMUX(0, 77, 4, 0, 0)
#define PTC20_ADC1_MA2                  NXP_S32_PINMUX(0, 84, 5, 0, 0)
#define PTC21_ADC1_MA1                  NXP_S32_PINMUX(0, 85, 5, 0, 0)
#define PTC27_ADC1_MA0                  NXP_S32_PINMUX(0, 91, 5, 0, 0)
#define PTF16_ADC1_MA0                  NXP_S32_PINMUX(0, 176, 4, 0, 0)
#define PTF17_ADC1_MA1                  NXP_S32_PINMUX(0, 177, 4, 0, 0)
#define PTF18_ADC1_MA2                  NXP_S32_PINMUX(0, 178, 4, 0, 0)
#define PTF29_ADC1_MA0                  NXP_S32_PINMUX(0, 189, 4, 0, 0)
#define PTF30_ADC1_MA1                  NXP_S32_PINMUX(0, 190, 4, 0, 0)
#define PTF31_ADC1_MA2                  NXP_S32_PINMUX(0, 191, 1, 0, 0)

/* SAI0 */
#define PTB2_SAI0_D0_O                  NXP_S32_PINMUX(0, 34, 6, 0, 0)
#define PTB2_SAI0_D0_I                  NXP_S32_PINMUX(0, 34, 0, 316, 1)
#define PTB3_SAI0_MCLK                  NXP_S32_PINMUX(0, 35, 0, 320, 1)
#define PTB29_SAI0_D1_O                 NXP_S32_PINMUX(0, 61, 7, 0, 0)
#define PTB29_SAI0_D1_I                 NXP_S32_PINMUX(0, 61, 0, 317, 1)
#define PTC12_SAI0_BCLK_O               NXP_S32_PINMUX(0, 76, 7, 0, 0)
#define PTC12_SAI0_BCLK_I               NXP_S32_PINMUX(0, 76, 0, 315, 1)
#define PTC13_SAI0_SYNC_O               NXP_S32_PINMUX(0, 77, 7, 0, 0)
#define PTC13_SAI0_SYNC_I               NXP_S32_PINMUX(0, 77, 0, 321, 1)
#define PTC18_SAI0_D2_O                 NXP_S32_PINMUX(0, 82, 7, 0, 0)
#define PTC18_SAI0_D2_I                 NXP_S32_PINMUX(0, 82, 0, 318, 1)
#define PTC19_SAI0_D3_O                 NXP_S32_PINMUX(0, 83, 7, 0, 0)
#define PTC19_SAI0_D3_I                 NXP_S32_PINMUX(0, 83, 0, 319, 1)

/* CAN4 */
#define PTB2_CAN4_RX                    NXP_S32_PINMUX(0, 34, 0, 4, 2)
#define PTB3_CAN4_TX                    NXP_S32_PINMUX(0, 35, 5, 0, 0)
#define PTC30_CAN4_TX                   NXP_S32_PINMUX(0, 94, 1, 0, 0)
#define PTC31_CAN4_RX                   NXP_S32_PINMUX(0, 95, 0, 4, 3)
#define PTE3_CAN4_TX                    NXP_S32_PINMUX(0, 131, 1, 0, 0)
#define PTE14_CAN4_RX                   NXP_S32_PINMUX(0, 142, 0, 4, 1)
#define PTE30_CAN4_TX                   NXP_S32_PINMUX(0, 158, 1, 0, 0)
#define PTE31_CAN4_RX                   NXP_S32_PINMUX(0, 159, 0, 4, 4)
#define PTG8_CAN4_TX                    NXP_S32_PINMUX(0, 200, 1, 0, 0)
#define PTG9_CAN4_RX                    NXP_S32_PINMUX(0, 201, 0, 4, 5)

/* LPUART9 */
#define PTB2_LPUART9_RX                 NXP_S32_PINMUX(0, 34, 0, 196, 2)
#define PTB3_LPUART9_TX_O               NXP_S32_PINMUX(0, 35, 1, 0, 0)
#define PTB3_LPUART9_TX_I               NXP_S32_PINMUX(0, 35, 0, 372, 1)
#define PTB9_LPUART9_RX                 NXP_S32_PINMUX(0, 41, 0, 196, 1)
#define PTB10_LPUART9_TX_O              NXP_S32_PINMUX(0, 42, 5, 0, 0)
#define PTB10_LPUART9_TX_I              NXP_S32_PINMUX(0, 42, 0, 372, 2)
#define PTF23_LPUART9_TX_O              NXP_S32_PINMUX(0, 183, 1, 0, 0)
#define PTF23_LPUART9_TX_I              NXP_S32_PINMUX(0, 183, 0, 372, 3)
#define PTF24_LPUART9_RX                NXP_S32_PINMUX(0, 184, 0, 196, 3)

/* ADC0 */
#define PTB3_ADC0_MA0                   NXP_S32_PINMUX(0, 35, 4, 0, 0)
#define PTC6_ADC0_MA2                   NXP_S32_PINMUX(0, 70, 7, 0, 0)
#define PTC14_ADC0_MA1                  NXP_S32_PINMUX(0, 78, 4, 0, 0)
#define PTC15_ADC0_MA2                  NXP_S32_PINMUX(0, 79, 4, 0, 0)
#define PTE2_ADC0_MA0                   NXP_S32_PINMUX(0, 130, 7, 0, 0)
#define PTE6_ADC0_MA1                   NXP_S32_PINMUX(0, 134, 7, 0, 0)
#define PTF9_ADC0_MA0                   NXP_S32_PINMUX(0, 169, 3, 0, 0)
#define PTF10_ADC0_MA1                  NXP_S32_PINMUX(0, 170, 3, 0, 0)
#define PTF11_ADC0_MA2                  NXP_S32_PINMUX(0, 171, 3, 0, 0)
#define PTF12_ADC0_MA0                  NXP_S32_PINMUX(0, 172, 3, 0, 0)
#define PTF13_ADC0_MA1                  NXP_S32_PINMUX(0, 173, 3, 0, 0)
#define PTF19_ADC0_MA2                  NXP_S32_PINMUX(0, 179, 4, 0, 0)

/* LPUART8 */
#define PTB12_LPUART8_RX                NXP_S32_PINMUX(0, 44, 0, 195, 1)
#define PTB13_LPUART8_TX_O              NXP_S32_PINMUX(0, 45, 6, 0, 0)
#define PTB13_LPUART8_TX_I              NXP_S32_PINMUX(0, 45, 0, 371, 1)
#define PTD15_LPUART8_RX                NXP_S32_PINMUX(0, 111, 0, 195, 2)
#define PTD16_LPUART8_TX_O              NXP_S32_PINMUX(0, 112, 7, 0, 0)
#define PTD16_LPUART8_TX_I              NXP_S32_PINMUX(0, 112, 0, 371, 2)
#define PTF20_LPUART8_TX_O              NXP_S32_PINMUX(0, 180, 1, 0, 0)
#define PTF20_LPUART8_TX_I              NXP_S32_PINMUX(0, 180, 0, 371, 3)
#define PTF21_LPUART8_RX                NXP_S32_PINMUX(0, 181, 0, 195, 3)

/* LPUART7 */
#define PTB14_LPUART7_RX                NXP_S32_PINMUX(0, 46, 0, 194, 1)
#define PTB15_LPUART7_TX_O              NXP_S32_PINMUX(0, 47, 6, 0, 0)
#define PTB15_LPUART7_TX_I              NXP_S32_PINMUX(0, 47, 0, 370, 1)
#define PTC19_LPUART7_TX_O              NXP_S32_PINMUX(0, 83, 1, 0, 0)
#define PTC19_LPUART7_TX_I              NXP_S32_PINMUX(0, 83, 0, 370, 2)
#define PTC20_LPUART7_RX                NXP_S32_PINMUX(0, 84, 0, 194, 4)
#define PTE0_LPUART7_RX                 NXP_S32_PINMUX(0, 128, 0, 194, 2)
#define PTE1_LPUART7_TX_O               NXP_S32_PINMUX(0, 129, 6, 0, 0)
#define PTE1_LPUART7_TX_I               NXP_S32_PINMUX(0, 129, 0, 370, 3)
#define PTF18_LPUART7_TX_O              NXP_S32_PINMUX(0, 178, 1, 0, 0)
#define PTF18_LPUART7_TX_I              NXP_S32_PINMUX(0, 178, 0, 370, 4)
#define PTF19_LPUART7_RX                NXP_S32_PINMUX(0, 179, 0, 194, 3)

/* LPUART13 */
#define PTB18_LPUART13_TX_O             NXP_S32_PINMUX(0, 50, 1, 0, 0)
#define PTB18_LPUART13_TX_I             NXP_S32_PINMUX(0, 50, 0, 376, 1)
#define PTB19_LPUART13_RX               NXP_S32_PINMUX(0, 51, 0, 200, 1)
#define PTC26_LPUART13_TX_O             NXP_S32_PINMUX(0, 90, 1, 0, 0)
#define PTC26_LPUART13_TX_I             NXP_S32_PINMUX(0, 90, 0, 376, 2)
#define PTC27_LPUART13_RX               NXP_S32_PINMUX(0, 91, 0, 200, 2)
#define PTG0_LPUART13_TX_O              NXP_S32_PINMUX(0, 192, 1, 0, 0)
#define PTG0_LPUART13_TX_I              NXP_S32_PINMUX(0, 192, 0, 376, 3)
#define PTG1_LPUART13_RX                NXP_S32_PINMUX(0, 193, 0, 200, 3)

/* LPUART14 */
#define PTB20_LPUART14_TX_O             NXP_S32_PINMUX(0, 52, 1, 0, 0)
#define PTB20_LPUART14_TX_I             NXP_S32_PINMUX(0, 52, 0, 377, 1)
#define PTB21_LPUART14_RX               NXP_S32_PINMUX(0, 53, 0, 201, 1)
#define PTD26_LPUART14_TX_O             NXP_S32_PINMUX(0, 122, 1, 0, 0)
#define PTD26_LPUART14_TX_I             NXP_S32_PINMUX(0, 122, 0, 377, 2)
#define PTD27_LPUART14_RX               NXP_S32_PINMUX(0, 123, 0, 201, 2)
#define PTG2_LPUART14_TX_O              NXP_S32_PINMUX(0, 194, 1, 0, 0)
#define PTG2_LPUART14_TX_I              NXP_S32_PINMUX(0, 194, 0, 377, 3)
#define PTG3_LPUART14_RX                NXP_S32_PINMUX(0, 195, 0, 201, 3)

/* LPUART15 */
#define PTB25_LPUART15_TX_O             NXP_S32_PINMUX(0, 57, 1, 0, 0)
#define PTB25_LPUART15_TX_I             NXP_S32_PINMUX(0, 57, 0, 378, 1)
#define PTB26_LPUART15_RX               NXP_S32_PINMUX(0, 58, 0, 202, 1)
#define PTD28_LPUART15_TX_O             NXP_S32_PINMUX(0, 124, 1, 0, 0)
#define PTD28_LPUART15_TX_I             NXP_S32_PINMUX(0, 124, 0, 378, 2)
#define PTD29_LPUART15_RX               NXP_S32_PINMUX(0, 125, 0, 202, 2)
#define PTG4_LPUART15_TX_O              NXP_S32_PINMUX(0, 196, 1, 0, 0)
#define PTG4_LPUART15_TX_I              NXP_S32_PINMUX(0, 196, 0, 378, 3)
#define PTG5_LPUART15_RX                NXP_S32_PINMUX(0, 197, 0, 202, 3)

/* LPUART5 */
#define PTB27_LPUART5_TX_O              NXP_S32_PINMUX(0, 59, 1, 0, 0)
#define PTB27_LPUART5_TX_I              NXP_S32_PINMUX(0, 59, 0, 368, 3)
#define PTB28_LPUART5_RX                NXP_S32_PINMUX(0, 60, 0, 192, 4)
#define PTD0_LPUART5_RX                 NXP_S32_PINMUX(0, 96, 0, 192, 2)
#define PTD1_LPUART5_TX_O               NXP_S32_PINMUX(0, 97, 1, 0, 0)
#define PTD1_LPUART5_TX_I               NXP_S32_PINMUX(0, 97, 0, 368, 1)
#define PTE3_LPUART5_RX                 NXP_S32_PINMUX(0, 131, 0, 192, 1)
#define PTE14_LPUART5_TX_O              NXP_S32_PINMUX(0, 142, 4, 0, 0)
#define PTE14_LPUART5_TX_I              NXP_S32_PINMUX(0, 142, 0, 368, 2)
#define PTF0_LPUART5_TX_O               NXP_S32_PINMUX(0, 160, 1, 0, 0)
#define PTF0_LPUART5_TX_I               NXP_S32_PINMUX(0, 160, 0, 368, 4)
#define PTF1_LPUART5_RX                 NXP_S32_PINMUX(0, 161, 0, 192, 3)

/* CAN3 */
#define PTC0_CAN3_TX                    NXP_S32_PINMUX(0, 64, 1, 0, 0)
#define PTC1_CAN3_RX                    NXP_S32_PINMUX(0, 65, 0, 3, 2)
#define PTC28_CAN3_TX                   NXP_S32_PINMUX(0, 92, 1, 0, 0)
#define PTC29_CAN3_RX                   NXP_S32_PINMUX(0, 93, 0, 3, 3)
#define PTD15_CAN3_RX                   NXP_S32_PINMUX(0, 111, 0, 3, 1)
#define PTE9_CAN3_TX                    NXP_S32_PINMUX(0, 137, 4, 0, 0)
#define PTE28_CAN3_TX                   NXP_S32_PINMUX(0, 156, 1, 0, 0)
#define PTE29_CAN3_RX                   NXP_S32_PINMUX(0, 157, 0, 3, 4)
#define PTF29_CAN3_TX                   NXP_S32_PINMUX(0, 189, 1, 0, 0)
#define PTF30_CAN3_RX                   NXP_S32_PINMUX(0, 190, 0, 3, 5)

/* TRACE */
#define PTC2_TRACE_ETM_CLKOUT           NXP_S32_PINMUX(0, 66, 6, 0, 0)
#define PTD7_TRACE_ETM_D0               NXP_S32_PINMUX(0, 103, 6, 0, 0)
#define PTD10_TRACE_ETM_D3              NXP_S32_PINMUX(0, 106, 4, 0, 0)
#define PTD11_TRACE_ETM_D2              NXP_S32_PINMUX(0, 107, 4, 0, 0)
#define PTD12_TRACE_ETM_D1              NXP_S32_PINMUX(0, 108, 4, 0, 0)
#define PTF28_TRACE_ETM_D5              NXP_S32_PINMUX(0, 188, 7, 0, 0)
#define PTF31_TRACE_ETM_D3              NXP_S32_PINMUX(0, 191, 7, 0, 0)
#define PTG6_TRACE_ETM_CLKOUT           NXP_S32_PINMUX(0, 198, 7, 0, 0)
#define PTG7_TRACE_ETM_D0               NXP_S32_PINMUX(0, 199, 7, 0, 0)
#define PTG15_TRACE_ETM_D1              NXP_S32_PINMUX(0, 207, 7, 0, 0)
#define PTG16_TRACE_ETM_D2              NXP_S32_PINMUX(0, 208, 7, 0, 0)
#define PTG17_TRACE_ETM_D4              NXP_S32_PINMUX(0, 209, 7, 0, 0)
#define PTG18_TRACE_ETM_D6              NXP_S32_PINMUX(0, 210, 7, 0, 0)
#define PTG19_TRACE_ETM_D7              NXP_S32_PINMUX(0, 211, 7, 0, 0)
#define PTG20_TRACE_ETM_D8              NXP_S32_PINMUX(0, 212, 7, 0, 0)
#define PTG21_TRACE_ETM_D9              NXP_S32_PINMUX(0, 213, 7, 0, 0)
#define PTG22_TRACE_ETM_D10             NXP_S32_PINMUX(0, 214, 7, 0, 0)
#define PTG23_TRACE_ETM_D11             NXP_S32_PINMUX(0, 215, 7, 0, 0)
#define PTG24_TRACE_ETM_D12             NXP_S32_PINMUX(0, 216, 7, 0, 0)
#define PTG25_TRACE_ETM_D13             NXP_S32_PINMUX(0, 217, 7, 0, 0)
#define PTG26_TRACE_ETM_D14             NXP_S32_PINMUX(0, 218, 7, 0, 0)
#define PTG27_TRACE_ETM_D15             NXP_S32_PINMUX(0, 219, 7, 0, 0)

/* QUADSPI */
#define PTC2_QUADSPI_IOFA3_O            NXP_S32_PINMUX(0, 66, 7, 0, 0)
#define PTC2_QUADSPI_IOFA3_I            NXP_S32_PINMUX(0, 66, 0, 308, 1)
#define PTC3_QUADSPI_PCSFA              NXP_S32_PINMUX(0, 67, 6, 0, 0)
#define PTD7_QUADSPI_IOFA1_O            NXP_S32_PINMUX(0, 103, 7, 0, 0)
#define PTD7_QUADSPI_IOFA1_I            NXP_S32_PINMUX(0, 103, 0, 306, 1)
#define PTD10_QUADSPI_SCKFA_O           NXP_S32_PINMUX(0, 106, 7, 0, 0)
#define PTD10_QUADSPI_SCKFA_I           NXP_S32_PINMUX(0, 106, 0, 309, 1)
#define PTD11_QUADSPI_IOFA0_O           NXP_S32_PINMUX(0, 107, 7, 0, 0)
#define PTD11_QUADSPI_IOFA0_I           NXP_S32_PINMUX(0, 107, 0, 305, 1)
#define PTD12_QUADSPI_IOFA2_O           NXP_S32_PINMUX(0, 108, 7, 0, 0)
#define PTD12_QUADSPI_IOFA2_I           NXP_S32_PINMUX(0, 108, 0, 307, 1)

