zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K344-257BGA-pinctrl.h
/* LPI2C1 */
#define PTC5_LPI2C1_HREQ                NXP_S32_PINMUX(0, 69, 0, 216, 2)
#define PTC6_LPI2C1_SDA_O               NXP_S32_PINMUX(0, 70, 1, 0, 0)
#define PTC6_LPI2C1_SDA_I               NXP_S32_PINMUX(0, 70, 0, 219, 2)
#define PTC7_LPI2C1_SCL_O               NXP_S32_PINMUX(0, 71, 3, 0, 0)
#define PTC7_LPI2C1_SCL_I               NXP_S32_PINMUX(0, 71, 0, 217, 1)
#define PTC15_LPI2C1_SCL_O              NXP_S32_PINMUX(0, 79, 7, 0, 0)
#define PTC15_LPI2C1_SCL_I              NXP_S32_PINMUX(0, 79, 0, 217, 6)
#define PTC16_LPI2C1_SDAS_O             NXP_S32_PINMUX(0, 80, 4, 0, 0)
#define PTC16_LPI2C1_SDA_O              NXP_S32_PINMUX(0, 80, 7, 0, 0)
#define PTC16_LPI2C1_SDA_I              NXP_S32_PINMUX(0, 80, 0, 219, 5)
#define PTC16_LPI2C1_SDAS_I             NXP_S32_PINMUX(0, 80, 0, 220, 1)
#define PTC17_LPI2C1_SCLS_O             NXP_S32_PINMUX(0, 81, 4, 0, 0)
#define PTC17_LPI2C1_SCLS_I             NXP_S32_PINMUX(0, 81, 0, 218, 2)
#define PTC28_LPI2C1_SCL_O              NXP_S32_PINMUX(0, 92, 5, 0, 0)
#define PTC28_LPI2C1_SCL_I              NXP_S32_PINMUX(0, 92, 0, 217, 4)
#define PTC29_LPI2C1_SDA_O              NXP_S32_PINMUX(0, 93, 5, 0, 0)
#define PTC29_LPI2C1_SDA_I              NXP_S32_PINMUX(0, 93, 0, 219, 3)
#define PTD8_LPI2C1_SDA_O               NXP_S32_PINMUX(0, 104, 2, 0, 0)
#define PTD8_LPI2C1_SDA_I               NXP_S32_PINMUX(0, 104, 0, 219, 1)
#define PTD9_LPI2C1_SCL_O               NXP_S32_PINMUX(0, 105, 2, 0, 0)
#define PTD9_LPI2C1_SCL_I               NXP_S32_PINMUX(0, 105, 0, 217, 2)
#define PTD12_LPI2C1_HREQ               NXP_S32_PINMUX(0, 108, 0, 216, 1)
#define PTF7_LPI2C1_SCL_O               NXP_S32_PINMUX(0, 167, 3, 0, 0)
#define PTF7_LPI2C1_SCL_I               NXP_S32_PINMUX(0, 167, 0, 217, 5)
#define PTF8_LPI2C1_SDA_O               NXP_S32_PINMUX(0, 168, 3, 0, 0)
#define PTF8_LPI2C1_SDA_I               NXP_S32_PINMUX(0, 168, 0, 219, 4)

/* CAN2 */
#define PTC6_CAN2_RX                    NXP_S32_PINMUX(0, 70, 0, 2, 6)
#define PTC7_CAN2_TX                    NXP_S32_PINMUX(0, 71, 7, 0, 0)
#define PTC14_CAN2_RX                   NXP_S32_PINMUX(0, 78, 0, 2, 2)
#define PTC15_CAN2_TX                   NXP_S32_PINMUX(0, 79, 1, 0, 0)
#define PTC16_CAN2_RX                   NXP_S32_PINMUX(0, 80, 0, 2, 1)
#define PTC17_CAN2_TX                   NXP_S32_PINMUX(0, 81, 3, 0, 0)
#define PTD18_CAN2_TX                   NXP_S32_PINMUX(0, 114, 1, 0, 0)
#define PTD19_CAN2_RX                   NXP_S32_PINMUX(0, 115, 0, 2, 4)
#define PTE24_CAN2_TX                   NXP_S32_PINMUX(0, 152, 3, 0, 0)
#define PTE25_CAN2_RX                   NXP_S32_PINMUX(0, 153, 0, 2, 3)
#define PTF25_CAN2_TX                   NXP_S32_PINMUX(0, 185, 1, 0, 0)
#define PTF26_CAN2_RX                   NXP_S32_PINMUX(0, 186, 0, 2, 5)

/* CAN5 */
#define PTC10_CAN5_TX                   NXP_S32_PINMUX(0, 74, 3, 0, 0)
#define PTC11_CAN5_RX                   NXP_S32_PINMUX(0, 75, 0, 5, 2)
#define PTC26_CAN5_RX                   NXP_S32_PINMUX(0, 90, 0, 5, 5)
#define PTC27_CAN5_TX                   NXP_S32_PINMUX(0, 91, 1, 0, 0)
#define PTD17_CAN5_RX                   NXP_S32_PINMUX(0, 113, 0, 5, 1)
#define PTE12_CAN5_TX                   NXP_S32_PINMUX(0, 140, 2, 0, 0)
#define PTF4_CAN5_TX                    NXP_S32_PINMUX(0, 164, 1, 0, 0)
#define PTF5_CAN5_RX                    NXP_S32_PINMUX(0, 165, 0, 5, 3)
#define PTG13_CAN5_TX                   NXP_S32_PINMUX(0, 205, 1, 0, 0)
#define PTG14_CAN5_RX                   NXP_S32_PINMUX(0, 206, 0, 5, 4)

/* LPUART10 */
#define PTC12_LPUART10_RX               NXP_S32_PINMUX(0, 76, 0, 197, 2)
#define PTC13_LPUART10_TX_O             NXP_S32_PINMUX(0, 77, 1, 0, 0)
#define PTC13_LPUART10_TX_I             NXP_S32_PINMUX(0, 77, 0, 373, 1)
#define PTE2_LPUART10_RX                NXP_S32_PINMUX(0, 130, 0, 197, 1)
#define PTE6_LPUART10_TX_O              NXP_S32_PINMUX(0, 134, 5, 0, 0)
#define PTE6_LPUART10_TX_I              NXP_S32_PINMUX(0, 134, 0, 373, 2)
#define PTF12_LPUART10_TX_O             NXP_S32_PINMUX(0, 172, 1, 0, 0)
#define PTF12_LPUART10_TX_I             NXP_S32_PINMUX(0, 172, 0, 373, 3)
#define PTF13_LPUART10_RX               NXP_S32_PINMUX(0, 173, 0, 197, 3)

/* LPUART12 */
#define PTC24_LPUART12_TX_O             NXP_S32_PINMUX(0, 88, 1, 0, 0)
#define PTC24_LPUART12_TX_I             NXP_S32_PINMUX(0, 88, 0, 375, 1)
#define PTC25_LPUART12_RX               NXP_S32_PINMUX(0, 89, 0, 199, 2)
#define PTE4_LPUART12_TX_O              NXP_S32_PINMUX(0, 132, 5, 0, 0)
#define PTE4_LPUART12_TX_I              NXP_S32_PINMUX(0, 132, 0, 375, 2)
#define PTE5_LPUART12_RX                NXP_S32_PINMUX(0, 133, 0, 199, 1)
#define PTF16_LPUART12_TX_O             NXP_S32_PINMUX(0, 176, 1, 0, 0)
#define PTF16_LPUART12_TX_I             NXP_S32_PINMUX(0, 176, 0, 375, 3)
#define PTF17_LPUART12_RX               NXP_S32_PINMUX(0, 177, 0, 199, 3)

/* SAI1 */
#define PTD13_SAI1_D0_O                 NXP_S32_PINMUX(0, 109, 6, 0, 0)
#define PTD13_SAI1_D0_I                 NXP_S32_PINMUX(0, 109, 0, 323, 1)
#define PTD14_SAI1_MCLK                 NXP_S32_PINMUX(0, 110, 0, 324, 1)
#define PTD15_SAI1_SYNC_O               NXP_S32_PINMUX(0, 111, 6, 0, 0)
#define PTD15_SAI1_SYNC_I               NXP_S32_PINMUX(0, 111, 0, 325, 1)
#define PTE8_SAI1_BCLK_O                NXP_S32_PINMUX(0, 136, 6, 0, 0)
#define PTE8_SAI1_BCLK_I                NXP_S32_PINMUX(0, 136, 0, 322, 1)

#endif /* HAL_NXP_DTS_NXP_S32_S32K344_257BGA_PINCTRL_H_ */
